{
    "title": "A Tiny Texas Village Is About To Annex a Gigantic Bitcoin Mine",
    "url": "https://www.wired.com/story/a-tiny-texas-hamlet-is-about-to-annex-an-industrial-scale-bitcoin-mine/",
    "publishedAt": "2024-07-16T11:30:00Z",
    "content": "To revisit this article, visit My Profile, then View saved stories.\nIn Oak Valley, a sleepy village in rural Navarro County, Texas, there is very little of anything. A potholed road runs through its two square miles of sun-beaten grassland, past a modest prefab community center and a “poor excuse for a park,” as the local mayor describes it.\nOnly around 400 people live in Oak Valley. But despite its diminutive size and few resources, the Texas hamlet is preparing to fold into its borders, through unusual means, an industrial-scale bitcoin mine—a move that could increase its annual budget by as much as fortyfold.\nFour miles away from Oak Valley on a 265-acre parcel of land, public crypto mining firm Riot Platforms is busily constructing what is set to become the world’s largest bitcoin mining facility, according to the company. Once complete, it will consume up to 1 gigawatt of energy, enough to power hundreds of thousands of homes.\nThe Riot facility currently sits on a patch of unincorporated land, in the jurisdiction of the Navarro County government. But the company is in the process of negotiating a deal, as shown by a series of email communications seen by WIRED, through which the plot will be annexed by Oak Valley.\nThe annexation plan, which has yet to be finalized, will make possible much-needed improvements to Oak Valley roads and other public infrastructure. Nor will it cost Riot anything, because the energy company serving the area will foot the bill. For Riot, it is a public relations gambit, meant to curry favor with local residents and county officials standing in the way of a lucrative discount on its property taxes. Millions of dollars potentially rides on its ability to garner local support in Navarro County before a final decision on its abatement application is reached.\nRiot declined to comment on the prospect of an annexation by Oak Valley. Brian Morgenstern, head of public policy at Riot, says only that “an annexation should be good for all sides.” “We want to make sure we are being good neighbors and bringing positive impacts to the community,” he says.\nTo fund public works, a township like Oak Valley has to rely predominantly on money collected from the electricity provider in exchange for the use of local rights-of-way. These so-called franchise fees are calculated as a percentage of residents’ energy bills. In normal circumstances, Oak Valley collects approximately $9,000 in franchise fees per year, which makes up 75 percent of a meager total budget that is insufficient to cover simple infrastructure improvements.\n“Oak Valley has no money,” says David Brewer, a commissioner in the Navarro County Commissioner’s Court, the governing body of the district. “Our county budget is extremely tight, so we can’t help some of the areas we want to.”\nHowever, if Oak Valley succeeds in annexing the energy-hungry Riot facility, says Brewer, it will hoover up franchise fees “to the tune of a quarter- to half-a-million dollars a year” once the 1-gigawatt plant is complete.\nLeading the push for the annexation is Max Taylor, the mayor of Oak Valley, who declined to be interviewed for this story. After a change of legislation in 2019, municipalities in Texas can no longer annex a parcel of land by force, so they must seek permission from the landowner. But Taylor appears to have had little trouble convincing Riot: “This project has my full support,” wrote David Schatz, senior vice president of operations at Riot, in an email to Taylor on June 25.\nThough the annexation would have no immediate, firsthand financial benefit for Riot, it represents an important chance for the company to make inroads with the local community. “It would just be a public relations kind of thing,” says Brewer. Riot is, he says, “desperate for some positive PR.”\nSince February 2022, the company has sought a property tax abatement in Navarro County worth roughly $6 million over 10 years, according to an economic impact report commissioned by Riot at the local government’s request. But the tax discount has so far been withheld by the county government in the face of a backlash by a protest group and other local residents.\nAccording to Riot, whether or not the abatement is granted could determine whether it builds out the Navarro County facility to full capacity or chooses to allocate the funds elsewhere. “The tax abatements would be an important part of making the economics work,” says Morgenstern.\nThe residents that oppose Riot in Navarro County cite various concerns, relating to potential noise pollution, the use of natural resources, and the facility’s possible effect on energy prices and the already-shaky Texas power grid. “They are hoping to win the bitcoin lottery and we are all subsidizing them,” says Jackie Sawicky, founder of the Texas Coalition Against Cryptomining, a local protest group trying to stand in the way of the expansion of Riot’s facility.\nRiot rejects these concerns as unfounded and claims the stance of the Texas Coalition Against Cryptomining is not representative of the general population. “We absolutely want buy-in,” says Morgenstern. Riot, he says, aims to “mobilize the people that support us, of which there are many. They vastly outnumber the opponents, we believe.”\nHowever, in March, before the Riot abatement was due to be voted upon by county commissioners, scores of local residents registered their disapproval. “We had so much negative input for an abatement,” says Brewer. “Between phone calls, emails, text messages, and people walking through the door, I had over 100 people encourage me not to give them a tax abatement.” Brewer says that not a single resident spoke in favor of granting Riot the discount.\nThe commissioners ultimately declined to vote on the matter, kicking the final decision to an unspecified future date. In the meantime, Riot needs a way to win over members of the local community.\nRiot has already thrown money at the problem, writing checks worth more than $100,000 in aggregate to local school districts and other community initiatives. To allay concerns about its presence, it hosted two meet-and-greet sessions in May and June with local residents. The annexation by Oak Valley could represent another opportunity to bring people around.\nIn a May 24 email entitled “Thoughts About Your PR Needs,” Taylor, the mayor of Oak Valley, advised Schatz on how the additional franchise fees might best be used to ingratiate Riot with county commissioners, the gatekeepers of the abatement. “I have a couple of thoughts about how to turn public sentiment in your favor,” he wrote.\nThe mayor’s idea was to invest surplus franchise fees in tackling the plague of feral dogs in Navarro County, a leading source of frustration among locals. “I think it’s the one single issue that not only could turn the residents in Navarro County into pro-Riot Platform (sic) supporters, but … could be the olive branch to turn [the commissioners] in favor of at least a partial ad valorem [according to value] abatement,” wrote Taylor.\nTaylor went on to explain that the commissioners are “longtime friends,” having attended church with them. “I think I can use the issues of animal control to hopefully get the Navarro County Commissioners onboard,” he wrote in a later email.\nUnder the annexation agreement with Riot, Taylor proposes, Oak Valley would promise to direct a percentage of the associated franchise fees to animal control in Navarro County, but only if commissioners agree to “some percentage of ad valorem tax abatement” for Riot. “I think I could sell this to the commissioners,” wrote Taylor.\nSchatz did not reply directly to this message, per the records seen by WIRED, but further down the thread, on June 25, signaled his continued enthusiasm for the annexation. “I am happy to see this process gaining more traction,” he told Taylor. “The fact that a percentage of the franchise fees will be going back into the community is definitely a win-win.”\nIn an email, Taylor told WIRED that “there was no under-the-table dealing or strong-arm tactics” and that Riot had not solicited his help. “These emails to Riot Platforms was an unsolicited offer by me to lend a hand in helping them build up goodwill in the county at a time that the abatement issue was still being discussed and debated in the community, and animal control was out of control in the county,” he says.\n“I never acted upon trying to broker any deal with the county for a partial abatement in order to have donated funds go towards animal control … and was never asked to by Riot Platforms.” Taylor says that he expects the annexation to be finalized in “maybe late August or September.”\nWhether Riot succeeds, with the help of the unlikely alliance with Oak Valley, in bringing Navarro County residents onside will remain unclear until the abatement issue comes up again for vote. A date for the vote has not yet been confirmed.\nBrewer is for his part supportive of Riot’s presence in Navarro County. He is also fearful, he says, that Riot will no longer invest in community initiatives or continue to expand its facility should the abatement not be granted. But when it comes time to vote, Brewer will take direction from his constituents.\n“As an elected official,” says Brewer, “The bottom line is that I have to make decisions based on what I think the majority of constituents in my precinct want, right?”\nNavigate election season with our WIRED Politics Lab newsletter and podcast\nDon’t think breakdancing is an Olympic sport? The world champ agrees (kinda)\nHow researchers cracked an 11-year-old password to a $3M crypto wallet\nThe uncanny rise of the world’s first AI beauty pageant\nGive your back a break: Here are the best office chairs we’ve tested\nMore From WIRED\nReviews and Guides\n© 2024 Condé Nast. All rights reserved. WIRED may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices"
}