{
    "title": "Bitcoin transaction cost hits four-year low",
    "url": "https://readwrite.com/bitcoin-transaction-cost-hits-four-year-low/",
    "publishedAt": "2024-07-10T11:21:16Z",
    "content": "Radek Zielinski is an experienced technology and financial journalist with a passion for cybersecurity and futurology.\nSam Shedden is an experienced journalist and editor with over a decade of experience in online news. A seasoned technology writer and content strategist, he…\nOn July 7, the average cost per Bitcoin transaction dropped to $38.69, the lowest in four years. Factors include lower demand for block space and reduced data volume, despite BTC trading above $58,200. Miners remain profitable but face tightening margins, with daily revenues dropping from $79M in March to $29M.\nOn July 7, the average cost per Bitcoin (BTC) transaction fell to its lowest level in four years, reaching $38.69, according to Blockchain.com.\nThis figure was last seen during the peak of the COVID-19 pandemic in 2020. The cost per transaction, calculated by dividing miners’ revenue by the total number of transactions processed, dropped despite Bitcoin trading above $58,200 on that day.\nTwo key factors contributed to this decrease: lower demand for block space and reduced data volume. On July 7, Bitcoin miners processed 673,752 transactions over the network. BTC transactions represented 89.7% of this total, with the remaining bandwidth used by other protocols like Ordinals, BRC-20, and Runes.\nDespite the lower cost per transaction, Bitcoin miners maintained profitability. Miners benefited from reduced network difficulty, allowing them to process transactions using comparatively less computational power.\nHowever, market intelligence firm CryptoQuant recently noted signs of miner capitulation as profit margins tighten in the post-halving environment and BTC prices approach $50,000. This capitulation involves miners reducing operational costs or selling portions of their Bitcoin earnings to remain viable during uncertain market conditions. A representative said:\nBitcoin Miner capitulation mirrors December 2022 levels with a 7.7% hashrate drop, similar to post-FTX collapse conditions. Such declines often signal potential market bottoms.\nCryptoQuant highlighted several indicators of miner stress, including a significant decline in Bitcoin’s hashrate and miners being “extremely underpaid” according to the miner profit/loss sustainability indicator. Daily miner revenues have seen a substantial decline since the halving when both base block rewards and transaction fee revenue were higher.\nThese trends suggest evolving challenges for Bitcoin miners as they adapt to changing market dynamics. The situation warrants close observation as it could have broader implications for the cryptocurrency ecosystem. The CryptoQuant representative added:\nTotal daily revenues have decreased from $79M on March 6 to $29M currently. Moreover, the revenue from transaction fees has fallen to only 3.2% of the total daily revenues, the lowest share since April 8.\nThe ReadWrite Editorial policy involves closely monitoring the tech industry for major developments, new product launches, AI breakthroughs, video game releases and other newsworthy events. Editors assign relevant stories to staff writers or freelance contributors with expertise in each particular topic area. Before publication, articles go through a rigorous round of editing for accuracy, clarity, and to ensure adherence to ReadWrite's style guidelines.\nRadek Zielinski is an experienced technology and financial journalist with a passion for cybersecurity and futurology.\nChimpzee is a project with a mission. It allows users to earn income while helping to protect the environment and animals. The project operates on the Ethereum blockchain with its native...\n\n\nBy signing up, you agree to our Terms and Privacy Policy. Unsubscribe anytime.\nExplore the latest in tech with our Tech News. We cut through the noise for concise, relevant updates, keeping you informed about the rapidly evolving tech landscape with curated content that separates signal from noise.\nExplore tech impact in In-Depth Stories. Narrative data journalism offers comprehensive analyses, revealing stories behind data. Understand industry trends for a deeper perspective on tech's intricate relationships with society.\nEmpower decisions with Expert Reviews, merging industry expertise and insightful analysis. Delve into tech intricacies, get the best deals, and stay ahead with our trustworthy guide to navigating the ever-changing tech market.\nREGULATION & HIGH RISK INVESTMENT WARNING: Trading Forex, CFDs and Cryptocurrencies is highly speculative, carries a level of risk and may not be suitable for all investors. You may lose some or all of your invested capital, therefore you should not speculate with capital that you cannot afford to lose. The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. Please note that we do receive advertising fees for directing users to open an account with the brokers/advertisers and/or for driving traffic to the advertiser website\n© ReadWrite. All Rights Reserved."
}