{
    "title": "Bitcoin slumps below $59,000 amid market uncertainty",
    "url": "https://readwrite.com/bitcoin-slumps-below-59000-amid-market-uncertainty/",
    "publishedAt": "2024-07-04T12:50:07Z",
    "content": "Radek Zielinski is an experienced technology and financial journalist with a passion for cybersecurity and futurology.\nSam Shedden is an experienced journalist and editor with over a decade of experience in online news. A seasoned technology writer and content strategist, he…\nBitcoin dropped below $59,000, trading at $58,827, its lowest since early May. Price decline attributed to Mt. Gox repayments and concerns over U.S. inflation and interest rates. Analysts expect continued volatility, with potential for a rebound if market liquidity stays strong.\nBitcoin’s (BTC) value dropped below $59,000 on Thursday, trading at $58,827.\nMarket data shows that Bitcoin has fallen 3.38% in the past day, reaching its lowest point since early May despite expectations of a price recovery. Rachael Lucas, a crypto analyst at Australia’s BTC Markets told The Block:\nThe fall below the $60,000 resistance line is significant as it marks a psychological barrier for many investors. […] If bitcoin remains below this level, we could see increased volatility in the short term.\nThe recent price fluctuations are largely attributed to the upcoming payout for Mt. Gox creditors, who are set to receive approximately 142,000 BTC (worth about $9 billion) starting in July. This follows Mt. Gox transferring $840 million worth of Bitcoin in late May. Lucas suggested this substantial repayment could exert “significant selling pressure” on the market.\nAdding to the uncertainty are concerns about U.S. inflation and interest rates. Federal Reserve Chair Jerome Powell recently stated that more work is needed to control inflation, despite acknowledging progress. Contrary to investor hopes for multiple reductions, the Fed’s indication of only one potential interest rate cut this year has contributed to a risk-averse market sentiment.\nWhile some analysts had predicted a July rebound for Bitcoin, citing historical patterns, Bit.com’s Chief Marketing Officer Toya Zhang expressed skepticism. Zhang cited low market liquidity and a lack of new crypto narratives as obstacles to significant growth without interest rate cuts.\nZhang also noted an increase in large sell orders at over-the-counter desks, suggesting that high-net-worth individuals and family offices are taking profits from the previous bull cycle. Recent data shows declining trading volumes for U.S. spot Bitcoin exchange-traded funds (ETFs), with volume dropping to around $800 million on Wednesday.\nLucas concluded by forecasting continued Bitcoin volatility in the coming week as the market processes the Mt. Gox repayments and reacts to broader economic indicators. She added that a rebound might occur if market liquidity remains strong, as has happened following previous significant selloffs.\nThe ReadWrite Editorial policy involves closely monitoring the tech industry for major developments, new product launches, AI breakthroughs, video game releases and other newsworthy events. Editors assign relevant stories to staff writers or freelance contributors with expertise in each particular topic area. Before publication, articles go through a rigorous round of editing for accuracy, clarity, and to ensure adherence to ReadWrite's style guidelines.\nRadek Zielinski is an experienced technology and financial journalist with a passion for cybersecurity and futurology.\nWith Bitcoin back in the green, up 13% on the week at $66,000, and Ethereum seeing gains as ETFs prepare to go live soon, the cryptocurrency market is beginning to...\n\n\nBy signing up, you agree to our Terms and Privacy Policy. Unsubscribe anytime.\nExplore the latest in tech with our Tech News. We cut through the noise for concise, relevant updates, keeping you informed about the rapidly evolving tech landscape with curated content that separates signal from noise.\nExplore tech impact in In-Depth Stories. Narrative data journalism offers comprehensive analyses, revealing stories behind data. Understand industry trends for a deeper perspective on tech's intricate relationships with society.\nEmpower decisions with Expert Reviews, merging industry expertise and insightful analysis. Delve into tech intricacies, get the best deals, and stay ahead with our trustworthy guide to navigating the ever-changing tech market.\nREGULATION & HIGH RISK INVESTMENT WARNING: Trading Forex, CFDs and Cryptocurrencies is highly speculative, carries a level of risk and may not be suitable for all investors. You may lose some or all of your invested capital, therefore you should not speculate with capital that you cannot afford to lose. The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. Please note that we do receive advertising fees for directing users to open an account with the brokers/advertisers and/or for driving traffic to the advertiser website\n© ReadWrite. All Rights Reserved."
}