{
    "title": "Canine commuters chase dog travel season tickets",
    "url": "https://www.bbc.com/news/articles/c725nrx0x9no",
    "publishedAt": "2024-06-27T13:40:20Z",
    "content": "Dogs are being offered boat and rail season tickets to ease their path to walkies in the Lake District.\nUllswater Steamers and the Ravenglass and Eskdale Railway have introduced £20 annual \"Rover\" season tickets, which include a 10% donation to animal charities.\nThe cost for a standard doggie day ticket is £2.50 for the railway and £1 for a boat trip.\nOperator Lake District Estates said it saw more than 6,000 dog railway tickets purchased in 2023, with over 10,000 taking journeys by water.\nThe season ticket includes a year’s worth of train or boat rides, a natty bandana and a charitable donation.\nFunds raised from rail sales will go to The Dog’s Trust and money from Ullswater 'Steamers' tickets will be donated to Eden Valley Animal Rescue and Oaktrees Animal Sanctuary in Wetheral.\nThe Ravenglass and Eskdale Railway is one of the oldest and longest narrow-gauge railways in England and takes passengers from Ravenglass to Dalegarth.\nMeanwhile, Ullswater Steamers carry passengers to walking routes including the Ullswater Way, Aira Force waterfall and the William Wordsworth daffodils at Glencoyne Bay.\nRachel Bell from Lake District Estates said Cumbria is a \"very popular dog-friendly destination\", adding: \"Every dog deserves to join in with family days out.\"\nFollow BBC Cumbria on X (formerly Twitter), Facebook and Instagram. Send your story ideas to northeastandcumbria@bbc.co.uk\nA number of services travelling between Ascot and Bagshot were disrupted on Friday evening.\nThe BBC speaks to Laisterdyke residents about their thoughts on a tram linking area to Leeds.\nCustomers are warned there may be cancellations and delays to trains and flights.\nWhat impact will Labour's pledge to nationalise the railways have?\nIf you face disruption because flights are cancelled or delayed, then what can you do?\nCopyright 2024 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking.\n"
}