{
    "title": "Climate Change Messaging Isn’t Getting Through",
    "url": "https://energycentral.com/c/cp/climate-change-messaging-isn%E2%80%99t-getting-through",
    "publishedAt": "2024-07-23T00:50:41Z",
    "content": "This group brings together the best thinkers on energy and climate. Join us for smart, insightful posts and conversations about where the energy industry is and where it is going.\nPresentation\nI provide consulting services primarily assisting renewable energy-related companies in areas such as strategic planning, marketing, and operations. I have helped bring to market numerous leading...\nAccess Presentation\nOver the past couple of weeks I reviewed  the results of two surveys: The Pew Research Center survey on How Americans View National, Local and Personal Energy Choices and the Resources for the Future Climate Insights 2024 Report. Neither offered results that can be considered encouraging to the climate movement.\nI am on record in believing that both the strategy and the messaging of those who are working to reduce global emissions is off target. In my opinion, these two surveys support my belief, mostly on the messaging side of the equation. Nonetheless, I encourage everyone to read the surveys themselves. They aren’t long and they are filled with easily digestible graphs.\nToday’s post consolidates and categorizes the results of both surveys. Tomorrow, I’ll  offer my suggestions on how the messaging of the climate movement should change.\n#climatechange #globalwarming #climatechangeisreal #severeweather #climateaction #pewresearchcenter #resourcesforthefuture\nNo discussions yet. Start a discussion below.\nOffshore Wind, hydrogen and island economies    Here's an article published four years ago which may interest the community?    Join over five-thousand stakeholders at the moderated focus-group, https://bit.ly/3gHQa0V  Offshore Wind and Hydrogen\nHydrogen-Electric propulsion for Large Aircraft\nEvery maturing industry eventually turns to automation to improve efficiencies and maintain profit margins. Solar is no different. Check out what one company is doing to expedite the construction of utility-scale solar projects.\nScaling Hydrogen-Electric propulsion for Large Aircraft\nThe Energy Central Power Industry Network® is based on one core idea - power industry professionals helping each other and advancing the industry by sharing and learning from each other.\nIf you have an experience or insight to share or have learned something from a conference or seminar, your peers and colleagues on Energy Central want to hear about it. It's also easy to share a link to an article you've liked or an industry resource that you think would be helpful.\nStart a Post »                  Learn more about posting on Energy Central »\nAnalyst - Senior Analyst, Utility Marketing and CX\n\t\t\tE Source\n\t\t\tDenver, Colorado\nChief Executive Officer \n\t\t\tCentral Valley Electric Cooperative \n\t\t\tArtesia, New Mexico\nVice President of Engineering\n\t\t\tLong Island Power Authority\n\t\t\tUniondale, New York\nChief Executive Officer\n\t\t\tKansas Electric Power Cooperative\n\t\t\tTopeka, Kansas\nPresident and Chief Executive Officer\n\t\t\tNOVEC\n\t\t\tManassas, Virginia\nEngineering Associate II\n\t\t\tLower Colorado River Authority\n\t\t\tLa Grange, Texas\nExecutive Director\n\t\t\tRedwood Coast Energy Authority\n\t\t\tHumboldt County, California\nDirector, Division of Revenue & Rates\n\t\t\tNew Jersey Board of Public Utilities\n\t\t\tTrenton, New Jersey\nTransmission Line Engineer: Operations and Maintenance (Civil/Structural)\n\t\t\tLCRA\n\t\t\tAustin, Texas\nPower Management Control Engineer\n\t\t\tCity of Tallahassee\n\t\t\tTallahassee, Florida\nAssistant General Manager for the Electric & Gas Utility\n\t\t\tCity of Tallahassee\n\t\t\tTallahassee, Florida\nSenior Engineer - Grid Infrastructure\n\t\t\tNorth Carolina Electric Cooperatives\n\t\t\tRaleigh, North Carolina\nManager - Cybersecurity and Energy Management System\n\t\t\tBrazos Electric Cooperative\n\t\t\tWaco, Texas\nPower Plant Control Room Operator (Gas/Coal)\n\t\t\tLower Colorado River Authority (LCRA)\n\t\t\tLa Grange, Texas\nChief Executive Officer\n\t\t\tDuck River EMC\n\t\t\tShelbyville, Tennessee\n"
}