{
    "title": "Craig Wright Faces Perjury Investigation Over Claims He Created Bitcoin",
    "url": "https://www.wired.com/story/craig-wright-perjury-bitcoin-trial/",
    "publishedAt": "2024-07-16T12:58:12Z",
    "content": "To revisit this article, visit My Profile, then View saved stories.\nA judge in the UK High Court has directed prosecutors to consider bringing criminal charges against computer scientist Craig Wright, after ruling that he lied “extensively and repeatedly” and committed forgery “on a grand scale” in service of his quest to prove he is Satoshi Nakamoto, creator of bitcoin.\nIn a judgment published Tuesday, Justice James Mellor outlined various injunctions to be imposed upon Wright, after finding in May that he had “engaged in the deliberate production of false documents to support false claims [to be Satoshi] and use the Courts as a vehicle for fraud.”\nBy order of the judge, Wright will be prevented from claiming publicly that he is Satoshi and from bringing or threatening legal action in any jurisdiction on that basis. He will be required to pin a notice to the front page of his personal website and X feed detailing the findings against him.\nThe matter, Mellor writes, will also be referred to the Crown Prosecution Service (CPS), the body responsible for prosecuting criminal cases in the UK, “for consideration of whether a prosecution should be commenced against Dr Wright.” It will be up to the CPS to decide whether the available evidence is sufficient to bring charges against Wright “for his wholescale perjury and forgery of documents” and “whether a warrant for his arrest should be issued.”\nWright did not respond immediately to a request for comment.\nThis latest judgment follows a six-week trial held earlier in the year to resolve a civil lawsuit brought by the Crypto Open Patent Alliance (COPA), a nonprofit consortium of crypto companies, against Wright. The organization asked the court to declare that Wright is not the creator of bitcoin, to prevent him from carrying forward multiple separate lawsuits against bitcoin developers and other parties built atop the claim.\nIn an attritional cross-examination, Wright was presented with documents bearing hundreds of alleged indications of forgery. Wright weaved a patchwork of justifications in a bid to explain away the abnormalities, but failed to convince the judge. On March 14, the final day of the trial, Mellor delivered a rare snap verdict: “The evidence is overwhelming,” he told the courtroom. “Dr Wright is not the person who adopted or operated under the pseudonym Satoshi Nakamoto.”\nIn a formal written judgment on May 20, Mellor expanded upon the reasoning behind his verdict, confirming that Wright had lied about creating Bitcoin and forged documents in service of that lie. “I am entirely satisfied that Dr Wright lied to the Court extensively and repeatedly. All his lies and forged documents were in support of his biggest lie: his claim to be Satoshi Nakamoto,” wrote Mellor.\nIn his latest judgment, Mellor underlined the importance, as he sees it, of blocking off any remaining avenues through which Wright might try to relitigate his claim to be Satoshi. “Dr Wright’s sinister and mendacious campaign to establish himself as Satoshi over many years and involving wholescale lies and forgery requires an extraordinary response,” he wrote.\nIn your inbox: Will Knight's Fast Forward explores advances in AI\nInside the biggest FBI sting operation in history\nThe WIRED AI Elections Project: Tracking more than 60 global elections\nEcuador is literally powerless in the face of drought\nRest assured: Here are the best mattresses you can buy online\nMore From WIRED\nReviews and Guides\n© 2024 Condé Nast. All rights reserved. WIRED may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices"
}