{
    "title": "Earth to humankind – we have a problem",
    "url": "https://energycentral.com/c/cp/earth-humankind-%E2%80%93-we-have-problem",
    "publishedAt": "2024-07-16T17:57:40Z",
    "content": "This group brings together the best thinkers on energy and climate. Join us for smart, insightful posts and conversations about where the energy industry is and where it is going.\nPresentation\nI provide consulting services primarily assisting renewable energy-related companies in areas such as strategic planning, marketing, and operations. I have helped bring to market numerous leading...\nAccess Presentation\nA couple of weeks ago I summarized the findings of the latest PEW Research survey on how Americans view personal energy choices. The overall findings were not particularly positive.\nBeing a data-driven person, I look at every data-rich report that crosses my desk. I do this because there is so much misinformation on climate change that focusing on data helps to eliminate the propaganda factor. True, data can also be biased and support a particular position, which is why I look at as much data as possible and note the potential biases of the source.\nToday the Resources for the Future Climate Insights 2024 Report pop up in my in-box. Resources for the Future is an independent, nonprofit based in Washington DC. Its mission is to improve environmental, energy, and natural resource decisions through impartial economic research and policy engagement. This report focuses on the American Understanding of Climate Change.\nIf the organization has any inherent biases, one might expect them to lean toward support of action to combat climate change. The report’s findings - although supportive of climate change – don’t scream bias. They indicate a general belief in climate change and the need to address it.\nThe findings – which I’ll summarize and comment on this week – indicate a strong “green” perspective among the public but also provide further evidence that the climate movement needs to rethink its messaging.\nToday – what do people believe about Earth’s rising temperatures.\n#climatechange #globalwarming #climatechangeisreal #severeweather #climateaction\nNo discussions yet. Start a discussion below.\nTesla has been on a rollercoaster ride for most of the year. The question is whether the coaster will be going up or down in the future. A just published Morgan Stanley survey of its interns provides a hint for Tesla, and EV adoption in general.\nEvery maturing industry eventually turns to automation to improve efficiencies and maintain profit margins. Solar is no different. Check out what one company is doing to expedite the construction of utility-scale solar projects.\nScaling Hydrogen-Electric propulsion for Large Aircraft\nThe World Bank  Global Finance and Hydrogen Development\nThe Energy Central Power Industry Network® is based on one core idea - power industry professionals helping each other and advancing the industry by sharing and learning from each other.\nIf you have an experience or insight to share or have learned something from a conference or seminar, your peers and colleagues on Energy Central want to hear about it. It's also easy to share a link to an article you've liked or an industry resource that you think would be helpful.\nStart a Post »                  Learn more about posting on Energy Central »\nAnalyst - Senior Analyst, Utility Marketing and CX\n\t\t\tE Source\n\t\t\tDenver, Colorado\nChief Executive Officer \n\t\t\tCentral Valley Electric Cooperative \n\t\t\tArtesia, New Mexico\nVice President of Engineering\n\t\t\tLong Island Power Authority\n\t\t\tUniondale, New York\nChief Executive Officer\n\t\t\tKansas Electric Power Cooperative\n\t\t\tTopeka, Kansas\nPresident and Chief Executive Officer\n\t\t\tNOVEC\n\t\t\tManassas, Virginia\nEngineering Associate II\n\t\t\tLower Colorado River Authority\n\t\t\tLa Grange, Texas\nExecutive Director\n\t\t\tRedwood Coast Energy Authority\n\t\t\tHumboldt County, California\nDirector, Division of Revenue & Rates\n\t\t\tNew Jersey Board of Public Utilities\n\t\t\tTrenton, New Jersey\nTransmission Line Engineer: Operations and Maintenance (Civil/Structural)\n\t\t\tLCRA\n\t\t\tAustin, Texas\nPower Management Control Engineer\n\t\t\tCity of Tallahassee\n\t\t\tTallahassee, Florida\nAssistant General Manager for the Electric & Gas Utility\n\t\t\tCity of Tallahassee\n\t\t\tTallahassee, Florida\nSenior Engineer - Grid Infrastructure\n\t\t\tNorth Carolina Electric Cooperatives\n\t\t\tRaleigh, North Carolina\nManager - Cybersecurity and Energy Management System\n\t\t\tBrazos Electric Cooperative\n\t\t\tWaco, Texas\nPower Plant Control Room Operator (Gas/Coal)\n\t\t\tLower Colorado River Authority (LCRA)\n\t\t\tLa Grange, Texas\nChief Executive Officer\n\t\t\tDuck River EMC\n\t\t\tShelbyville, Tennessee\n"
}