{
    "title": "Heavy rain warnings issued as cool, wet summer continues",
    "url": "https://www.bbc.com/weather/articles/c6p2nq0x7p5o",
    "publishedAt": "2024-07-15T10:43:56Z",
    "content": "With heavy rain moving in across the United Kingdom on Monday and Tuesday, yellow rain warnings have been issued by the Met Office.\nSome localised flooding, travel disruption and difficult driving conditions are possible along with a small chance of power cuts.\nThe cool and wet July continues to bring a rather disappointing start to summer for many of us so far.\nThere are signs of some warmer and drier conditions later in the week.\nMet Office yellow warnings for rain in force for Monday across England and Wales\nThe first yellow warning is valid all day on Monday and covers south-west England and much of Wales.\nThere could be as much as 30-40mm (1-1.5in) of rain falling in a space of a few hours which could lead to some localised flooding.\nLightning may also accompany the heavy rain in places.\nMet Office weather warnings\nUK flood warnings\n\nLater on Monday and into Tuesday, the heavy rain will have moved further north-east where another yellow warning will be in force from 3pm Monday to 9am Tuesday.\nThe Met Office warning suggests heavy rain will cause some localised flooding in places with travel disruption.\nBy Tuesday there will be slow moving and heavy showers affecting north-east England and parts of Scotland\nOn Tuesday there will be some slow moving and thundery showers affecting northern parts of England and southern Scotland.\nA yellow warning will come into force across north-east England, Cumbria, south-west Scotland, up into Grampian from 8am to 8pm on Tuesday.\nSlow moving showers could bring 30-40mm (1-1.5in) of rain in a three- to four-hour period to some areas which could lead to some localised flooding.\nThe odd lightning strike is also possible.\nThe first half of July has been notably wet and cool for many of us.\nLoftus in north-east England has already recorded over twice the average July rainfall, with 147mm (5.8in) falling compared to the whole month average of 62mm (2.4in).\nEven in southern England, Northolt in west London and Weybourne, Norfolk have seen more than a month’s worth of rain.\nAccording to the Central England Temperature series – the longest temperature record in the world – the maximum temperature has been around two degrees lower than average.\nThe cool and wet July has been a result of the jet stream – fast moving wind high in the atmosphere – being positioned predominantly over or to the south of the UK.\nBeing on the north side of the jet stream means we are influenced by the colder Arctic air.\nAnd as the jet stream is responsible for spinning up areas of low pressure, weather fronts bringing rain and breezy conditions have been a constant feature of our weather.\nWarmer weather could be on the way into next week\nTemperatures will creep up later this week, but only temporarily for now.\nOn Friday we will get some warmer south-westerly winds bringing temperatures into the low to mid-20s.\nIf we reach 25C, that would be the first time this July we have seen this temperature.\nThe last time that we didn't pass 25C anywhere in the UK in the first 15 days of July was 2004.\nIt should also become a bit drier for many too.\nBeyond the end of this week, our monthly outlook suggests \"hints of warmer weather\".\nLow pressure looks like retreating to the north-east of the UK with a large area of high pressure to extend into the UK.\nHigh pressure would suggest a drier, possibly sunnier spell of weather where temperatures could rise to above or above average for the time of year.\nMonthly Outlook\nWeather for the Week Ahead. VideoWeather for the Week Ahead\nUK's hottest day of the year so far\nWhy do we feel so much hotter on humid days? VideoWhy do we feel so much hotter on humid days?\nChina bridge collapse kills at least 11 after floods\nWeather quiz: Five questions about summer\nUV index: Levels explained and how to protect yourself\n'This was a crime against humanity'\nBetween 1963 and 1974, over 2,000 people in Cyprus went missing\n\"Deadpool & Wolverine should be a musical!\"\nRyan Reynolds and Hugh Jackman hear the Radio 1 listeners' unfiltered, unpopular opinions\nThe fake cricket cup that stumped Russian gamblers\nThe true story of an audacious sporting scam, master-minded by a tiny Indian village\nWhat went wrong?\nIn 2023, a triple-train crash in India killed nearly 300 people and injured more than 800\n© 2024 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking."
}