{
    "title": "How to Use an eSIM for International Travel",
    "url": "https://www.wired.com/story/how-to-use-buy-esim-international-travel-trips/",
    "publishedAt": "2024-07-17T11:00:00Z",
    "content": "To revisit this article, visit My Profile, then View saved stories.\nAn international vacation is a nice opportunity to cut down on your excessive smartphone screen time and be present to soak up all those adventures. (Don’t let life pass you by!) But even if you’re spending less time doomscrolling and more time exploring a new city, you’ll probably still want to use that phone to find your way around, book last-second tours, and stay in touch with friends back home.\nIf you're traveling internationally, your normal phone plan likely doesn’t include data access in the destination country. Switching over to a local data plan during your trip used to involve swapping in a SIM card you got after landing. But it’s 2024, and you no longer need to purchase a physical card on the way out of the airport—if your smartphone is new enough to have an electronic SIM. An eSIM is a small version of a SIM card that's built into a device.\nLast year, I bought a data package from Airalo and installed the eSIM onto my iPhone before heading to Costa Rica. Based on my experience using it, I was impressed with the decently affordable plan as well as the reliable connection.\nAre you considering using an eSIM during your next international trip? Here’s everything you need to know, including whether your phone is compatible, how much data you actually need to buy, and how to set the eSIM up on your phone.\nAs a general rule, if you’ve purchased a smartphone released within the past five years, it likely has an eSIM option. Kudos to you if you have a smartphone that’s older than the iPhone XR model, though it’s probably past time at least to get the battery switched out, and you’ll definitely need to get a newer model phone to access eSIM capabilities.\nSome smartphones, like the iPhone 15 (7/10, WIRED Recommends) and the Google Pixel 8A (8/10, WIRED Recommends), even have two eSIMs built in, so you can operate dual phone numbers on the same device. This could be helpful if you’re going back and forth between two countries with different data plans.\nAlso, you’ll need to make sure that your phone is not locked to a single carrier before getting an eSIM. Checkout this helpful article from Consumer Reports for a guide to unlocking your phone’s provider. Still need help? Reach out to your carrier, whether it’s AT&T, T-Mobile, or Verizon, for more assistance.\nMost international eSIM data plans are prepaid, so the amount of data you should purchase depends on how much you expect to be using your smartphone while traveling and which apps you plan to use the most. And Airalo is just one of the eSIM options you can purchase online to avoid wandering around your first day in a new country trying to buy a physical SIM card. AloSIM and Airhub are two other popular choices for travelers.\nWant to video chat with loved ones before bed and share jealousy-inducing video clips? You’ll likely want to opt for a larger data package, and even that may quickly run out. If you’re just looking to get around using Google Maps and send occasional texts and photos to friends over WhatsApp, then a smaller data package is likely sufficient. Of course, the longer the vacation, the more data you’ll need to consider prepurchasing.\nIn Costa Rica, I was able to get around just fine with 2 GB of data during my two-week trip, and it cost $17. I scrimped on data by using Wi-Fi wherever possible and switching the phone off when I didn’t need to be connected. Although, I did notice that I racked up data usage by absentmindedly watching videos on social media near the end of the trip. Some things never change.\nWorried about going over? During the trip, I tracked my daily data in the Airalo app, and this helped put the usage rate into better perspective. Even though I didn’t end up needing it, the app offered deals if I wanted to add just a smidge more data to the plan to finish the trip off.\nIn addition to the amount of data you need, pay attention to when the data will expire for the eSIM. For example, the plan I got expired 15 days after activation, which was a great length for that trip.\nEven though the installation and activation are the most daunting part of the process of getting online with an eSIM, as long as you’re not in a rush and remain open to troubleshooting, it shouldn’t be too overwhelming. Start off by making sure you have a steady internet connection. If this is your first time setting up an eSIM, check out the online guides for the Apple iPhone, Google Pixel, or Samsung Galaxy for more help.\nYou have the option to choose between a direct, manual, or QR code set up for the Airalo eSIM—I found the direct method to be fairly accessible on an iPhone. No matter the type of phone you own, Airalo’s installation starts off by opening the app (Android, iOS) and visiting the My eSIMs tab. Then, tap on the one you want to install.\nNext, choose View Instructions, and Direct after that. Read through the block of text on this screen for additional details about the whole process, and then press Install eSIM.\nHere’s where the installation process will diverge based on your device, and it’s worth checking out the company’s user guides for iPhones, Pixels, and Galaxies that are available online. Also, if you're an iPhone owner, and you’re installing the eSIM before heading out on your trip, then leave the default line as your Primary SIM. But if you’re already on vacation, you could pick the new Secondary SIM throughout this process.\nWhenever you’re ready to activate the eSIM and start using the international data plan, open the Settings on your smartphone and follow the steps laid out on Airalo’s website for your device (linked above).\nYou’ll need to make sure the eSIM line and the phone’s data roaming option are both turned on. Encountering any problems activating it? Check out Airalo’s help center for additional advice. You can also reach out to the company directly.\nIn your inbox: Will Knight's Fast Forward explores advances in AI\nInside the biggest FBI sting operation in history\nThe WIRED AI Elections Project: Tracking more than 60 global elections\nEcuador is literally powerless in the face of drought\nRest assured: Here are the best mattresses you can buy online\nSave $7 To $23 On Turbo Tax Online\n20% Off All H&R Block 2024 Tax Software | H&R Block Coupon\nEnjoy $15 Off Your Orders With Instacart Coupon\nExtra 20% Off Select Dyson Technology With Owner Rewards\nGet Up To An Extra 45% Off July Sale\nVista Print Coupon Code: 20% Off Select Signage\nMore From WIRED\nReviews and Guides\n© 2024 Condé Nast. All rights reserved. WIRED may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices"
}