{
    "title": "How to Navigate Summer Holiday Travel Like a Pro",
    "url": "https://www.wired.com/story/how-to-navigate-summer-holiday-travel-like-a-pro/",
    "publishedAt": "2024-06-26T10:00:00Z",
    "content": "To revisit this article, visit My Profile, then View saved stories.\nIf you buy something using links in our stories, we may earn a commission. Learn more.\nSummer's here, and there's no better time to get out and see the world. Maybe you've been patiently hoarding airline points, or maybe you're a frequent flyer who's been zipping around the globe since the pandemic travel restrictions first lifted.\nNo matter how elite your status, travel is going to look different this year. Crowds have swelled. There are new apps to download. Airport checkpoints have new equipment and new procedures. And is everyone really just using chatbots now? (Yes, but it's going to be OK.)\nRead on for our guidance on what to expect when you hit the road, and how to navigate the new landscape like a total pro.\nYou may already have a destination in mind, like a concert in a foreign city or a tour of a wine-growing region. But maybe you just need an escape and you aren't sure where to go. When planning travel, no spark of inspiration is more powerful than cheap tickets. So let's go hunting for deals.\nOne of the best resources for airfare deals is Going. (It used to be known as Scott's Cheap Flights, but it's largely the same.) Head to Going.com or open the mobile app, plug in your home airport, and tell it where you want to go. You can choose a specific destination and see airfare deals for that city, or decide that you're \"open for adventure\" to see deals to multiple places. The service will start sending you alerts whenever cheap airfare pops up. The deals are deep: Tickets typically start at half price and the discounts get steeper from there. The airlines are all ones you've heard of, and the dates aren't last-minute; you can usually book a trip a month or so out. Going's service costs less than $5 a month, and you can change your preferred airports as often as you like.\nAnother way to find cheap tickets is Google Flights. The airfare search engine is powerful and fast, with a helpful calendar-based fare table so you can see what days of the week are the cheapest to fly. Just last month, Google added longtime holdout Southwest Airlines to its search service, so now you can truly comparison shop for the cheapest plane tickets.\nAnd you mustn't skip Skyscanner. The website has long been an excellent resource for finding cheap flights, letting you search for departure and destination airports as well as showing you the cheapest days to fly that route. Its \"Everywhere\" option, which shows you all the best deals to multiple cities from your home airport, is a treat for the adventurous traveler. Skyscanner can also help you find deals on hotels and rental cars.\nSpeaking of hotels, there's been far less disruption in the lodging space. All of the big hotel search platforms—Expedia, Kayak, Priceline, HotelTonight—are still some of the best places to look for good rates. My personal favorite deal-snagger is Google Maps. It has a powerful search function that lets you narrow the selection based on price, location, and amenities before letting you comparison shop by showing you rates from all of the big platforms listed above, along with a few discount websites I've never heard of. The reviews are helpful—and helpfully honest—on Google Maps as well.\nGoogle Maps will show you some properties that are private homes rented out by their owners, but only if they are rented through an agency or some other rental business. The best way to find private residences to rent is through the big rental platforms like Airbnb and Vrbo. My favorite Airbnb feature is the Play category, which narrows your search to include only properties with some sort of recreational addition to the rental. You'll find places that have pool tables, tennis courts, vintage video game arcades, basketball courts, bowling alleys in the basement, and other wacky things that can eliminate any chance of boredom on a family vacation or a group reunion trip.\nYou can stay on a farm if that works for you. Or in a castle. Maybe the best Airbnb category: treehouses.\nSome of our favorite travel apps have been our mobile companions for years. Others are brand-new. Download these first-class selections before your trip.\nApp in the Air is an all-around trip planner. It collates all of your itinerary info—terminal, gate, flight times, delays, confirmation numbers, hotel addresses—and organizes it on the app's dashboard. Any sudden changes get served as push notifications. It can send alerts to your Apple Watch or Wear OS watch as well. You can use the app to book flights and hotels, but those features are not as useful as the options above.\nGoogle Maps is a no-brainer. Explore your destination city ahead of time and click \"Save\" on each place you know you might want to visit. Then download all the maps for your itinerary before you leave home. Now you have zoomable maps in your pocket at all times, regardless of whether you have a reliable data connection when you arrive.\nMaps.me is an excellent alternative to Google Maps. Its offline functionality is even better, with more details and reviews for hot spots available on downloaded maps. In some cities, it even has hiking and transit info that Google doesn't. I use Google's maps most of the time, but they're not perfect. Maps.me is a great supplement.\nGoogle Translate is a powerful tool that translates typed text, photographed text, and spoken words. In a country where I don't speak the language, I can't get through dinner without it. Download the dictionary for your native language and the local language, and you can translate between the two without an internet connection.\nFind out who operates the local bike- and scooter-share systems in your destination city. It's different everywhere; Mexico City uses Ecobici, for instance, which doesn't exist anywhere else. Download the local app, sign up for an account, and load up some funds before you go. Most bike-shares are tap-to-ride, so you'll be ready when you land.\nLikewise, while Uber and Lyft exist in many world cities, most places use other rideshare services. Grab is the most popular in Southeast Asia, for example. Find out what the locals use and sign up before your trip.\nRome2Rio is a service that connects multiple transit systems along a route to help you get from city to city, or just across a large metro area. For example, if your day trip to the pinball museum requires rides on a bus, a subway, a ferry, and a light rail, this app will show you all the segments, times, and prices for the whole journey on one map.\nHappy Cow is a secret guidebook for the plant-based kings and queens. The app shows you a map of all the vegan and vegetarian restaurants in your location, plus the veg-friendly spots and the nearby organic markets. I use it whenever I'm in a new city, and believe me, I stay well nourished. The listings are global.\nAmericans have a few options for getting through airport checkpoints more quickly. US Citizens can sign up for TSA PreCheck. It requires a security screening, including a background check and fingerprinting, which is usually conducted at your local airport. But once you're cleared, you can zip through security in an expedited PreCheck line. It's typically less than five minutes long, and you never have to remove your laptop or take off your shoes. The Transportation Security Administration used to occasionally grant PreCheck status to travelers it deemed \"low risk,\" but the agency recently stopped doing this. Now the only way to get PreCheck is to go through the process. It costs around $80, but many credit cards offer it as a perk, so check yours.\nIf you're interested in TSA PreCheck and you often travel internationally, also consider paying a little extra for Global Entry. This costs $100, includes TSA PreCheck, and affords you faster and easier entry back into the US and into some other countries' airports (77 airports in all).\nThe popular alternative is Clear, which affords many of the same luxuries as TSA PreCheck, except that it's run by a private company instead of the US government. It skips the document check and relies on biometric scanners instead. Clear costs $179 a year for an individual, and there's a discount for additional family members. Clear has been expanding and now has dedicated fast lanes in 57 US airports.\nThose options require signing up, paying fees, and waiting for approval, but here's a free tool you can use now to speed up reentry at the end of your trip. Mobile Passport Control is an app developed by the US Customs and Border Protection agency. If you're a US or Canadian citizen, you can upload all of your customs declaration information into the app and present it with your passport when you enter the US. Up to 12 people can submit their customs info in one request through the app, so if you're traveling internationally as a family, MPC can save a lot of time. It works at 33 airports and points of entry; check the US Customs website for the list. The full process is a little convoluted (hey, it's the government!), but the website has clear instructions.\nOur advice for international travel has always been to pack any necessary power adaptors that will allow you to use your electronics in your destination country. But the bit that we really want to stress is that you should bring multiple adaptors; a few for your laptop and a few for charging your smaller gadgets. You'll lose at least one, guaranteed, but also these things are typically quite cheaply made, and they can get fried or crap out without warning, so having backups can be critical.\nAnother time-tested bit of advice is to put AirTags in your luggage so you can track down lost, stolen, or misplaced bags. That's great advice you should follow. But if you're an Android user, AirTags won't work with your phone. So instead, get a Chipolo tracker. There's the keychain-friendly One Point ($28) which works great for luggage, and the credit-card-shaped Card Point ($35), which slips into a wallet or passport sleeve. Both can be tracked using Android's native Find My Device app. If you want to track your kids or pets too, try Jiobit's Smart Tag, which works anywhere in the US. It's more expensive—it costs $130 and requires a cheap cellular data plan to connect to GPS—but the Jiobit can find your loved one should they wander away from the group tour at the ice cream factory.\nMachine translation is getting better at a phenomenal rate, and its growth has resulted in an explosion in dedicated, handheld translation devices. This is a type of single-function touchscreen handset that you speak into, or hold up when someone else is talking, and it translates their speech into your native tongue. It's the same concept as Google Translate, but in a dedicated device that's faster and more powerful. A good handheld translator allows you to conduct a real conversation across two languages when you hold it between the two people speaking. We've tested a few of them; our favorite is the Pocketalk Plus Voice Translator. The $290 price tag includes a global data SIM so it always has a connection to its cloud-based translation software.\nFor just about the same price as a pocket translator, you can get yourself a pair of Meta Ray-Bans, which have microphones, speakers, and a camera onboard. You can use the AI-powered smart glasses to search the web for information about whatever object you point the camera at. You can also point the camera at a sign, menu, or piece of text written in a foreign language and ask the glasses to translate it into spoken English. Just know that its list of available languages is limited, and the AI translation doesn't work all that well. Our own Kate Knibbs tried the translation feature and found that it still feels like “an experiment.”\nIn 2023, travel numbers shot up after a multiyear pandemic slump. Most experts have forecast that 2024 will see the number of travelers increase yet again.\nNew data from the American Automobile Association projects that a record 60.6 million people will drive to their holiday destination over the coming Independence Day weekend. That's a 5 percent bump over last year, and an 8 percent gain on 2019's number. Likewise, AAA says 5.74 million people will fly to their July 4th destinations, which is a 7 percent increase over last year and 12 percent higher than 2019.\nCruises, buses, and trains are also expected to see a 9 percent jump in passengers in July. According to AAA, this bump in cruises is thanks to targeted discounts, so if you're in the market for a cruise or a train trip, there should be plenty of competitive deals to help you find cheap tickets.\nData from travel industry analyst firm Phocuswright predicts that specific regions will be busier. The Paris Olympics will give France a boost, but other European destinations will see bumps as travelers seek alternatives to avoid the crowds. Air capacity to countries in Asia has grown, and China has eased some visa requirements and will see a boost in tourism because of it.\nSo plan ahead. Study local reports to see what the busiest travel days are going to be, and schedule your flight or hit the road the day before or after that busiest day. Friday afternoons are always the heaviest travel days during the summer, and while Thursday and Saturday are still bananas, at least the crowds will be more manageable on those days.\nWherever you trek this summer, expect to see technology transforming the travel experience—mostly for the better. More countries are adopting digital identity technologies at customs and immigration checkpoints, with retinal scanners, face-recognition cameras, and document scanners becoming more common. The use of biometric authentication is even extending out to cruise ships, nightclubs, and ticketed entertainment events.\nWhile these systems do have their flaws, in most situations they speed up lines and lead to less waiting around. Some airlines have adopted passport and document verification systems inside their mobile apps. Check to see if your airline's app lets you upload photos of your license or passport to speed up check-in and boarding. Opt in to a face or retina scan when you see them in use to keep things speedy, but if there's an option to opt out and you take it, the screening will take longer.\n\"All these technologies are intended to make the traveler journey seamless and frictionless,\" says Charuta Fadnis, a senior vice president of research and product strategy at Phocuswright, in an email.\nThe new piece of tech you're most likely to encounter on this summer's journey is a customer service chatbot. With the rise of general artificial intelligence tools, hotels, ticketing services, and travel websites are more eager than ever to send you to a chatbot to help you find what you need. You're probably groaning at that thought, but the most recent AI advances mean today's chatbots are actually pretty sophisticated.\n\"Customer service chatbots are not new, but generative AI has enhanced their efficacy and speed of resolution significantly,\" says Fadnis. She says the proliferation of generative tools has led to a better chatbot experience overall, but also a reduction in customer service calls to human agents. If you want to spend less time on hold, embrace the bot.\nThey're widespread enough that you'll likely encounter several of them on your journey. Priceline has been giving its AI assistant, Penny, new features over the last year. Expedia has a new AI-powered assistant named Romie that helps out during the planning, booking, and travel stages of a trip.\nGenerative AI has proven to be adept at creating quick summaries from a bunch of results; we've seen Google and Perplexity leverage this ability (with varying results) in its search products. The travel industry is also taking advantage of this power in summarizing reviews, Fadnis says. So if you are looking for a high-level summary to tell you whether a hotel or restaurant is worth your trouble, you can browse summarized reviews on Tripadvisor, Expedia, MakeMyTrip, and Home2Go to help you build an itinerary.\nNavigate election season with our WIRED Politics Lab newsletter and podcast\nDon’t think breakdancing is an Olympic sport? The world champ agrees (kinda)\nHow researchers cracked an 11-year-old password to a $3M crypto wallet\nThe uncanny rise of the world’s first AI beauty pageant\nGive your back a break: Here are the best office chairs we’ve tested\nExtra 20% Off Select Dyson Technology With Owner Rewards\nGet Up To An Extra 45% Off July Sale\nVista Print Coupon Code: 20% Off Select Signage\nNewegg Coupon 10% Off\nStudent Discount Peacock Premium for $1.99/Mo\nExplore DJI's Student Discounts & Educational Offers For 2024\nMore From WIRED\nReviews and Guides\n© 2024 Condé Nast. All rights reserved. WIRED may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices"
}