{
    "title": "Humankind – this is earth – we have a problem - Part 2",
    "url": "https://energycentral.com/c/cp/humankind-%E2%80%93-earth-%E2%80%93-we-have-problem-part-2",
    "publishedAt": "2024-07-18T01:05:45Z",
    "content": "This group brings together the best thinkers on energy and climate. Join us for smart, insightful posts and conversations about where the energy industry is and where it is going.\nPresentation\nI provide consulting services primarily assisting renewable energy-related companies in areas such as strategic planning, marketing, and operations. I have helped bring to market numerous leading...\nAccess Presentation\nYesterday we started a summary of the recent Resources for the Future Climate Insights 2024 Report which highlights how attitudes toward global warming seem somewhat stagnant. This is despite what appears to be conclusive data showing that the earth is indeed warming and at an accelerated pace.\nThe good news is that a large majority of Americans do recognize the earth is getting warmer. Still, 25% of those that believe temperatures are rising don’t necessarily believe the trend will continue. And there remains a non-inconsequential portion of the population that is still unconvinced.\nMy take is that the climate movement has done a very poor job of messaging.\nToday we’ll summarize additional findings related to people’s perceptions of what is likely to occur in the next 100 years. These findings seem to support the notion that despite ample ammunition - in the form of data - progress in winning over skeptics remains stalled.\n#climatechange #globalwarming #climatechangeisreal #severeweather #climateaction\nNo discussions yet. Start a discussion below.\nEvery maturing industry eventually turns to automation to improve efficiencies and maintain profit margins. Solar is no different. Check out what one company is doing to expedite the construction of utility-scale solar projects.\nMost people who follow the renewable energy industry know that California and Texas lead the way in solar deployment. But do you have any idea which state is the leader in rooftop systems on a per capita basis?\nRecently United States House Committee on Oversight and Accountability completed its three-year investigation into how U.S. oil companies sought to avoid accountability for climate change.\nHydrogen technology shows promise, but has a long way to go before being ready for prime time. Still, progress is being made in deploying hydrogen-powered transportation technology. Check out the presentation for three recent milestones.\nThe Energy Central Power Industry Network® is based on one core idea - power industry professionals helping each other and advancing the industry by sharing and learning from each other.\nIf you have an experience or insight to share or have learned something from a conference or seminar, your peers and colleagues on Energy Central want to hear about it. It's also easy to share a link to an article you've liked or an industry resource that you think would be helpful.\nStart a Post »                  Learn more about posting on Energy Central »\nAnalyst - Senior Analyst, Utility Marketing and CX\n\t\t\tE Source\n\t\t\tDenver, Colorado\nChief Executive Officer \n\t\t\tCentral Valley Electric Cooperative \n\t\t\tArtesia, New Mexico\nVice President of Engineering\n\t\t\tLong Island Power Authority\n\t\t\tUniondale, New York\nChief Executive Officer\n\t\t\tKansas Electric Power Cooperative\n\t\t\tTopeka, Kansas\nPresident and Chief Executive Officer\n\t\t\tNOVEC\n\t\t\tManassas, Virginia\nEngineering Associate II\n\t\t\tLower Colorado River Authority\n\t\t\tLa Grange, Texas\nExecutive Director\n\t\t\tRedwood Coast Energy Authority\n\t\t\tHumboldt County, California\nDirector, Division of Revenue & Rates\n\t\t\tNew Jersey Board of Public Utilities\n\t\t\tTrenton, New Jersey\nTransmission Line Engineer: Operations and Maintenance (Civil/Structural)\n\t\t\tLCRA\n\t\t\tAustin, Texas\nPower Management Control Engineer\n\t\t\tCity of Tallahassee\n\t\t\tTallahassee, Florida\nAssistant General Manager for the Electric & Gas Utility\n\t\t\tCity of Tallahassee\n\t\t\tTallahassee, Florida\nSenior Engineer - Grid Infrastructure\n\t\t\tNorth Carolina Electric Cooperatives\n\t\t\tRaleigh, North Carolina\nManager - Cybersecurity and Energy Management System\n\t\t\tBrazos Electric Cooperative\n\t\t\tWaco, Texas\nPower Plant Control Room Operator (Gas/Coal)\n\t\t\tLower Colorado River Authority (LCRA)\n\t\t\tLa Grange, Texas\nChief Executive Officer\n\t\t\tDuck River EMC\n\t\t\tShelbyville, Tennessee\n"
}