{
    "title": "I quit teaching to become a luxury-travel advisor. Since making the transition, I've learned a lot and grown professionally.",
    "url": "https://www.businessinsider.com/luxury-travel-agent-former-teacher-career-journey-lessons-2024-6",
    "publishedAt": "2024-06-27T13:18:15Z",
    "content": "Kaylee Stith is a travel agent at The Travel Mechanic, a luxury-travel agency in North Carolina. This as-told-to essay is based on a conversation with Stith, who left her full-time teaching job to become a luxury-travel agent last year. It has been edited for length and clarity.\nBefore I started travel advising, I worked as a middle-school special-education teacher in North Carolina.\nI stumbled upon the travel-agent industry. I was following someone on Instagram who recently started her own Disney-specific travel agency. I love Disney, and when she announced that she was hiring an agent, I thought that would be a fun part-time job. I applied and made it through the first round. I didn't get hired, but I couldn't stop thinking about becoming a travel advisor.\nAfter that, I started exploring on my own. I listened to podcasts about the industry and learned more from the American Society of Travel Advisors.\nOne day I was listening to \"Trade Secrets,\" a travel-agent podcast, when they interviewed Lauren Doyle, the president and owner of The Travel Mechanic, an agency based where I live in Raleigh, North Carolina. I filled out the form for prospective agents and interviewed, and I was offered a position on the team. I signed a contract on April 1, 2023, and left my full-time teaching role in June 2023.\nSome of my skills transferred from teaching, like being organized and helping people. Because I came from a special-education setting, I was often the liaison between students and their teachers. Being a travel advisor is similar because you're connecting with your clients and interfacing with them.\nBut the transition was also a challenge, because I forgot what it feels like not to know what you're doing.\nMy dad is a commercial airline pilot, and I've been traveling my whole life and planning my own trips for a long time. I assumed I'd naturally slide into this role and automatically know how to do everything. But there's a lot to learn.\nThere were very practical things I had to learn, like how to use the customer-relationship-management system we put client information into, how to take payments, and how to make sure clients are signing off on the right terms and conditions — a lot of that was new to me.\nI offer a complimentary consultation and discuss options with the client to ensure we're both a good fit. Then I charge a flat-rate planning fee. Some agents have a base amount, and depending on how complicated the trip is or how many people are going, they might charge more. Once the client pays the fee, I put their itinerary together.\nI also make a commission on things like hotels and tour packages. Some suppliers will pay a decent commission; if you work on the higher end, you make a bigger commission. Commissions are usually paid out after the client has finished the trip.\nBecause I work with The Travel Mechanic, I get some leads, but I have to find most of them on my own. So a big part of this job is telling everyone I'm a travel agent. I'll mention it in conversations with people I meet because it's travel, it's fun, and people enjoy talking about that.\nMy clients have so far been in my circles. I've worked with several people from my church, friend groups, and family. Sometimes it's good to start with the people near you.\nIt's good to have a niche to present yourself as an expert in when starting out. My niches are Hawaii and the UK because they're what I know and love. My family loves Hawaii, and I've visited regularly since I was 9. I've also been to England many times. I studied abroad in college and lived in Bath for four months as a student.\nThe locations are similar in some ways because they're higher-ticket bucket-list destinations. They're also great destinations for first-time travelers who want to adventure out on a bigger trip but go somewhere that feels familiar.\nHawaii is still far away, but the driving and currency are familiar. Though England is also pretty far away, the language and culture are not that different from the US. Those are my two favorite destinations, and I do some Disney trips on the side.\nMany people think this job is fun and relatively easy to get into. You don't need specific training, but it can be hard to get going. It's a marathon, not a sprint.\nIf you want to get into travel advising, I recommend starting part time or having another source of income before you get established and move to full time.\nAlso, do a lot of research. This will help you see if you're a good fit for the industry and find an agency you feel aligned with that will support you. If you're unsure where to start, visit Host Agency Reviews to research agencies near you.\nWhile it's possible to go at it alone, starting with an agency is easier. Your commissions with an agency may be a bit lower, but an agency will offer advice and assist you when you're starting out with leads.\nI attended the annual Ensemble travel-agent conference in Las Vegas last year. I met with suppliers, tour operators, destination-management companies, and other agents. Everyone was welcoming and encouraging, which was a pleasant surprise. Because I'm an independent contractor, it'd be easy to think I'm competing with other people, but that isn't the case; there are enough clients to go around.\nAlso, I learned that it's OK that I'm not the perfect fit for everyone. I can be a perfectionist, but it's impossible to always get everything right. I had a potential client who contacted me about a honeymoon, and I felt like it was a great conversation, but she never got back to me. I couldn't stop thinking what did I do wrong? But I can't be the best fit for everyone. It's been a tough lesson, but I've learned and grown so much this past year.\nJump to"
}