{
    "title": "Is new record heat putting climate goals at risk?",
    "url": "https://www.dw.com/en/is-new-record-heat-putting-climate-goals-at-risk/a-69593532",
    "publishedAt": "2024-07-08T13:30:00Z",
    "content": "New data shows global temperatures breached the crucial 1.5 degrees Celsius threshold for 12 months in a row. What does this sustained heat mean for tackling climate change?\nJune 2024 was the warmest on record with temperatures 1.5 degrees Celsius (2.7 degrees Fahrenheit) hotter than pre-industrial averages, according to new data from the Copernicus Climate Change Service (C3S).\nThe findings released today by C3S, a scientific organization that is part of the EU’s space program, show June saw global surface air temperatures 0.67 C above the 1991-2020 average and broke the record previously set by the month last year.\nAccording to the data — which draws on billions of measurements from ships, satellites, aircraft and weather stations around the world — June was the thirteenth month in a row with record- breaking average temperatures.\nIt was also the twelfth consecutive month in which average global temperatures were either 1.5 degrees Celsius or more above those in the pre-industrial period between 1850 and 1900. That's when humans started warming the planet by burning fossil fuels and pumping greenhouse gases into the atmosphere.\n\"We know that our climate is changing and warming, but the streak of record-breaking warm temperatures, both air and sea, has been exceptional and concerning,\" Rebecca Emerton, C3S senior scientist told DW. \"We expect to see new records, but it can be surprising when we see records being broken by such large amounts as we have seen particularly over this past year.\"\nShe added that as our climate warms, we can expect to see more and more extremes and that \"sustained periods of time with warmer and warmer temperatures will only make this more likely.\"\nThe data reveals that in Europe, the highest above-average heat was recorded in southeast regions and Turkey, while for the rest of the world Brazil, the Middle East, northern Africa, western Antarctica, Mexico and the western states of the US were the hotspots.\nAnd sweltering heat is not limited to land. The data also states average sea surface temperatures in June marked the fifteenth month in a row they have broken records.\nOcean warming can fuel sea level rise and lead to coral bleaching, intensified storms and damage to sea life.\nThe greenhouse gases driving climate change come mainly from the burning of fossil fuels like coal, oil and gas, as well as deforestation and livestock farming.\nMost of the world’s nations agreed to hold global temperature rise to well below 2 degrees Celsius (3.6 Fahrenheit) compared to pre-industrial levels and try to keep it below 1.5 degrees when they adopted the Paris Agreement in 2015.\nCrossing the 1.5 C target would not mean immediate disaster for everyone, Sergey Paltsev, deputy director of MIT's Joint Program on the Science and Policy of Global Change, told DW.\n\"The science does not tell us that if, for example, the temperature increase is 1.51 degrees Celsius, that it would definitely be the end of the world,\" he explained.\nHowever, the 1.5 degrees threshold is seen as a line of defense against climate change’s most severe and irreversible effects.\nScientists say going beyond this would expose millions more people to the catastrophic impacts of weather extremes, including heatwaves and intensifying storms and wildfires.\nMany developing nations, despite contributing least to global emissions, are already bearing the brunt of climate change’s impact.\nNot quite, but we are moving closer.\n\"At the moment, the twelve consecutive months with temperatures reaching or exceeding the 1.5 Celsius threshold does not mean that the Paris Agreement has been breached,\" said Emerton.\n\"The Paris Agreement limits are targets for the average temperature of the planet over a 20 or 30-year period, but it is important to monitor how quickly we are closing in on long-term thresholds, and the cumulative effects of shorter-term exceedances will become increasingly serious.\"\n2023 was the hottest year on record with close to 50% of days more than 1.5C above pre-industrial levels.\nThe new findings show global average temperatures from July 2023 to June 2024 were 1.64C above pre-industrial figures.\nWhile 13 consecutive months of record temperatures in the new findings are \"unusual\", C3S notes a similar streak happened between 2015-2016.\n\"The real discussion is: Are we able to go below 1.5 again later in the century?\" Carlo Buontempo, director of the C3S said in an earlier interview with DW.  \"We have the tools to make 1.5 possible but that means very, very dramatically [cutting] the amount of greenhouse gas emissions.\"\nTo stay within the Paris limits, scientists say global greenhouse gas emissions would need to peak in 2025, reduce by over 40% by 2030 and reach net zero by 2050.\nWhile action needs to ramp up quickly, progress has been made to slow climate change. Renewables such as wind, solar and other green technologies like electric cars are expanding rapidly and falling in price. Before the Paris Agreement, humanity was heading for a potentially catastrophic 3.5 C global warming by 2100.\n“Even if this specific streak of extremes ends at some point, we are bound to see new records being broken as the climate continues to warm. This is inevitable, unless we stop adding greenhouse gases into the atmosphere and the oceans,\" said Buontempo.\nEdited by: Tamsin Walker\nSources:\nhttps://www.un.org/en/climatechange/science/climate-issues/degrees-matter\nWhat 1.5C means, United Nations\nhttps://climate.copernicus.eu/copernicus-2023-hottest-year-record\n2023 hottest year on record, C3S"
}