{
    "title": "Julian Assange Received $500,000 Bitcoin Donation To Cover Travel Costs",
    "url": "https://slashdot.org/story/24/06/27/209220/julian-assange-received-500000-bitcoin-donation-to-cover-travel-costs",
    "publishedAt": "2024-06-27T21:30:00Z",
    "content": "Want to read Slashdot from your mobile device? Point it at m.slashdot.org and keep reading!\nNickname:\nPassword:\nNickname:\nPassword:\nThe Fine Print: The following comments are owned by whoever posted them.  We are not responsible for them in any way.\nWell, that doesn't cover apparently what needed to happen.  What, is he supposed to fly commercial like a peasant?\nAlso, apparently because he still refuses to step foot onto US soil even though the DoJ has agreed to the plea deal, and you can only plead to federal charges in a federal court (in person), he had to fly (private, of course) to a US territory - namely the United States District Court for the Northern Mariana Islands [uscourts.gov] to enter his plea and elocution, before resuming the private jet flight to Australia.\nUnited States District Court for the Northern Mariana Islands to enter his plea and elocution, before resuming the private jet flight to Australia.Then he should have gotten a round trip ticket between Mariana and the UK.\nUnited States District Court for the Northern Mariana Islands to enter his plea and elocution, before resuming the private jet flight to Australia.\nThen he should have gotten a round trip ticket between Mariana and the UK.\nHow is Saipan different to mainland USA, wrt the reasons he would not set foot on \"American soil\"?\nJulian Assange’s choice to fly to Saipan rather than “step on US soil” likely relates to the legal and jurisdictional distinctions between the Northern Mariana Islands and the mainland USA. Here are some key points that might explain why this matters:\n1.    Jurisdiction and Legal Authority: Although the Northern Mariana Islands (including Saipan) are a U.S. commonwealth and U.S. federal law applies, there are certain nuances in jurisdiction. The local government has significant autonomy, and some legal processes might differ slightly from those on the mainland. Assange might have believed that the local authorities might handle his case differently or that there might be some procedural advantages.\n        2.    Extradition and Legal Proceedings: By being on Saipan, Assange might have hoped to exploit any potential delays or differences in the legal process. The extradition process or any legal proceedings initiated from the mainland could potentially face additional bureaucratic steps when dealing with a U.S. commonwealth, although U.S. federal authorities still have considerable power.\n        3.    Perceived Legal Ambiguity: Assange might have perceived a symbolic or practical difference in being in a U.S. commonwealth rather than a state. While U.S. federal law is enforceable in the Northern Mariana Islands, there could be a perception (right or wrong) that this could complicate immediate legal actions or create some form of ambiguity that could be leveraged.\n        4.    Publicity and Strategy: Assange’s choice might also have been a strategic move to draw attention to the complexities of U.S. jurisdiction and to highlight his ongoing concerns about extradition and legal treatment. By choosing a location like Saipan, he might have intended to emphasize the lengths he was willing to go to avoid direct U.S. jurisdiction.\n        5.    Historical and Legal Precedents: There might be specific legal precedents or historical cases where individuals in U.S. territories have experienced different legal outcomes compared to those in the mainland. Assange’s legal team might have considered such factors in advising his travel choices.\nAlso, as part of any plea agreement, Assange would have to step into a US court to \"accept\" the plea deal.  The \"relevant\" US judge would exercise various requirements for a successful plea deal, such as examining the plea agreement conforms to US law (note the unsuccessful Hunter Biden plea deal), and have the defendant answer questions like \"do you understand the agreement?\", \"do you plead guilty?\", etc. which has to be done first person.\nAssange could have just flew to a continental US court rather than M\n\"The U.S. government wasn’t willing to go as far as releasing him onto a commercial flight, and Assange wasn’t willing to let U.S. Marshals escort him. So a compromise was struck: Assange would take a private plane to and from the island, escorted by an Australian ambassador.\" -- https://www.washingtonpost.com... [washingtonpost.com]\nWhich is why the US Government probably said \"We don't care if you swim there, but you're due for court on ${DATE} and the deal's off if you don't show.\"\nThey were more than happy to transport him, but he didn't agree to the mode or method.  So fine, fly private and pay for it yourself.\nWhat an arrogant piece of shit this guy is.\nOh, look, CIA contractors are checking in.\nRight?! Always the \"Anonymous Coward\" that the rest of us don't have access to post under..\nThese fuckers want to keep smearing and lying because they think that they can hide the truth. The way the world has reacted to the Wikileaks releases really highlights how stupid and arrogant they are, and how WRONG they are.\nFor those who want to know what actually happened, read 'The Trial of Julian Assange' by Nils Melzer\nI agree with the anonymous poster. The optics of this are poor for him in any case, but this is probably about keeping himself in media despite his irrelevance to current year topics. Being arrogant on someone elseâ(TM)s dime might garner him some intangible satisfaction.\nDid you have anything to add to this conversation that is more substantial than a personal attack?\nYeah, that was my first thought.  There's no motivation to suggest Assange is a head case for deciding to fly private.\n> because he doesn't want to sit next to a US marshal for a few more hours?\nIn chains, literally.\nThat bad photo op is worth more than -$500K\nSince he was willing to incur the cost and donors were willing to cover it, why do you think you should get to shit on his business decision?\nOne suspects it's not about that.\nThe irony is it's a lot easier to get a private flight to divert than commercial so none of it makes sense except the US Deep State wanted the photo op of him in chains.\nPerhaps you agree publishers should be treated this way?\nNone of the men snickering on the Collateral Murder video have faced charges - just the whistleblowers.\nif it's our government, we shouldn't need to hack servers to find out what is going on\nthe problem is secrecy hides corruption and irresponsibility, which are our real problems\nwhatever his motives or methods, they were a reaction to an unethical situation\nmeanwhile tools and fools let the real evil continue unabated\njust saying\n> because he doesn't want to sit next to a US marshal for a few more hours?In chains, literally.That bad photo op is worth more than -$500KNo more than the flight to the Marianas, onto to Australia a relatively insignificant addition. Could have gotten photos on the flight in if anyone gave a shit.\n> because he doesn't want to sit next to a US marshal for a few more hours?\nIn chains, literally.\nThat bad photo op is worth more than -$500K\nNo more than the flight to the Marianas, onto to Australia a relatively insignificant addition. Could have gotten photos on the flight in if anyone gave a shit.\nHave you heard of PTSD?\nHave you heard of PTSD?Yes, but his experience hardly qualifies.\nHave you heard of PTSD?\nYes, but his experience hardly qualifies.\nI don't like Assange at all. Doesn't matter. In this situation, preferring not to ride with a scorpion across the river is very wise on his part.\nI don't like Assange at all. Doesn't matter. In this situation, preferring not to ride with a scorpion across the river is very wise on his part.Not a scorpion. He was in no danger. Its just his ego.\nI don't like Assange at all. Doesn't matter. In this situation, preferring not to ride with a scorpion across the river is very wise on his part.\nNot a scorpion. He was in no danger. Its just his ego.\nNo danger? Rofl.\nNo danger? Rofl.A marshal delivers people, nothing more. Paranoid fantasies don't match reality.\nNo danger? Rofl.\nA marshal delivers people, nothing more. Paranoid fantasies don't match reality.\nA marshal delivers people, nothing more. Paranoid fantasies don't match reality.\nDelivers people to where precisely?\nAnd do you think this: https://en.wikipedia.org/wiki/... [wikipedia.org] is a paranoid fantasy or something that actually happened? It is likely this time? Not especially. Would you be willing to gamble a few years of getting tortured by Americans on it? Well that's up to you, but I don't really see why it pisses you off that Assange isn't really willing to make that gamble.\nA marshal delivers people, nothing more. Paranoid fantasies don't match reality. Delivers people to where precisely?A short flight to Australia and having all this behind you. Rather than more delays and US$500K for ego.Would you be willing to gamble a few years of getting tortured by Americans on it?Total paranoid fantasy. The who point of a plea deal is that its over, there's no threat of even a normal prosecution.\nA marshal delivers people, nothing more. Paranoid fantasies don't match reality.\nDelivers people to where precisely?\nA short flight to Australia and having all this behind you. Rather than more delays and US$500K for ego.\nWould you be willing to gamble a few years of getting tortured by Americans on it?Total paranoid fantasy. The who point of a plea deal is that its over, there's no threat of even a normal prosecution.\nWould you be willing to gamble a few years of getting tortured by Americans on it?\nTotal paranoid fantasy. The who point of a plea deal is that its over, there's no threat of even a normal prosecution.\nHmm paranoid fantasy.\nAre you claiming America has never illegally kidnapped and tortured people?\nDelivers people to where precisely?Exactly the same place he was going already.And do you think this: https://en.wikipedia.org/wiki/ [wikipedia.org]... [wikipedia.org] is a paranoid fantasy or something that actually happened?No the paranoid fantasy is not understanding the nuances of kidnapping people on terror lists, vs the kidnapping of a highly public white Australian for whom you just entered a legally binding plea deal while undergoing diplomatic discussions with that national's home country.The paranoid fantasy is not that the USA are cunts who do horrible things, it's that they would do them so publicly in this case.\nDelivers people to where precisely?\nExactly the same place he was going already.\nAnd do you think this: https://en.wikipedia.org/wiki/ [wikipedia.org]... [wikipedia.org] is a paranoid fantasy or something that actually happened?No the paranoid fantasy is not understanding the nuances of kidnapping people on terror lists, vs the kidnapping of a highly public white Australian for whom you just entered a legally binding plea deal while undergoing diplomatic discussions with that national's home country.The paranoid fantasy is not that the USA are cunts who do horrible things, it's that they would do them so publicly in this case.\nAnd do you think this: https://en.wikipedia.org/wiki/ [wikipedia.org]... [wikipedia.org] is a paranoid fantasy or something that actually happened?\nNo the paranoid fantasy is not understanding the nuances of kidnapping people on terror lists, vs the kidnapping of a highly public white Australian for whom you just entered a legally binding plea deal while undergoing diplomatic discussions with that national's home country.\nThe paranoid fantasy is not that the USA are cunts who do horrible things, it's that they would do them so publicly in this case.\nGiven all he has seen and published, I can completely understand why he wouldn't trust the US with his safety.\nNot a scorpion. He was in no danger. Its just his ego.you sound bitter, just curious, which side are you on?https://www.youtube.com/watch?... [youtube.com]\nNot a scorpion. He was in no danger. Its just his ego.\nyou sound bitter, just curious, which side are you on?\nhttps://www.youtube.com/watch?... [youtube.com]\nNot a scorpion. He was in no danger. Its just his ego.you sound bitter, just curious, which side are you on?The rational side. You are very close to home. Get there fast, put it all behind you faster. US$500K for ego is absurd.\nNot a scorpion. He was in no danger. Its just his ego.you sound bitter, just curious, which side are you on?\nNot a scorpion. He was in no danger. Its just his ego.\nyou sound bitter, just curious, which side are you on?\nThe rational side. You are very close to home. Get there fast, put it all behind you faster. US$500K for ego is absurd.\nThe man is a hero. He is allowed to be able to protect his dignity\nThe man is a hero. He is allowed to be able to protect his dignityHe's a liar. Editting war video to manufacture his desired narrative. His dignity died long long ago. All that is left is ego. \n\nA short flight. US$500K for ego. It all could have been over and him back at home in Australia sooner.\nThe man is a hero. He is allowed to be able to protect his dignity\nHe's a liar. Editting war video to manufacture his desired narrative. His dignity died long long ago. All that is left is ego. \n\nA short flight. US$500K for ego. It all could have been over and him back at home in Australia sooner.\nThat's because the judge and court can reject the plea deal. Just because the prosecution has agreed to it doesn't mean it's actually a done deal. DOJ can say what they want; but if that judge in the courtroom ultimately decides to reject the deal...well...there is no deal. Now he's in a US court, on US soil, with a rejected plea deal. He's taken into custody, the ambassador is totally powerless, and he gets the trial the us government wants him to have.\nWasn't ALLOWED to use Domestic flights.\nThis was just a bit more fuckery put on him.\nNot going to Saipan, but what about to mainland USA, like Washington?\nStep 1. Quantas, UK to Australia, non-stop, US$2,700\nStep 2. Profit.The poor bloke has suffered enough... At least pick a decent airline like Singapore, you can pick up a business class seat on sale for £2500. Definitely a premium economy seat. \n\nEspecially on the 787 Squeezeliner QF uses on that route. And worse yet, it stops in Perth... I think I'd prefer Gitmo over having to go back to Perth, even if only for a few hours. \n\nIn all seriousness, I doubt he'd just be able to buy a ticket and rock up at Heathrow. There's a whole bunch of security issues to consider. Su\nStep 1. Quantas, UK to Australia, non-stop, US$2,700\nStep 2. Profit.\nThe poor bloke has suffered enough... At least pick a decent airline like Singapore, you can pick up a business class seat on sale for £2500. Definitely a premium economy seat. \n\nEspecially on the 787 Squeezeliner QF uses on that route. And worse yet, it stops in Perth... I think I'd prefer Gitmo over having to go back to Perth, even if only for a few hours. \n\nIn all seriousness, I doubt he'd just be able to buy a ticket and rock up at Heathrow. There's a whole bunch of security issues to consider. Su\nIn all seriousness, I doubt he'd just be able to buy a ticket and rock up at Heathrow. There's a whole bunch of security issues to consider.All the more reason to just sit next to a US Marshal for a few more hours and put it all behind you sooner. \n\nWhat we have is US$500K for ego.\nIn all seriousness, I doubt he'd just be able to buy a ticket and rock up at Heathrow. There's a whole bunch of security issues to consider.\nAll the more reason to just sit next to a US Marshal for a few more hours and put it all behind you sooner. \n\nWhat we have is US$500K for ego.\nIt's a big club, and you ain't in it.--George CarlinThe BTC whale is likely someone who sees Assange as a useful idiot.  Wants to make sure he's taken care of for the next game Assange will play as a pawn in.And yeah, Julian Assange is a dolt.  He's like that idiot in class who'd make a sound and then stop when you look at them and wonder what you're looking at.  Assange is a perpetual pot stirrer and the whale is buying a Grade A Black and Decker Pot Stirrer with the half million dollars.I think this whole episode is some bullshit.  He totally came out the gate as \"look, I'm being a freedom fighter and exposing the truth\" and then when consequences came, he ran and hid in an embassy.  AND while he was hiding there, he kept posting \"I'm a big man\" bullshit until he eventually burned every ounce of goodwill the embassy extended to him.  AND THEN once he was finally suffering consequences and not even serious ones, \"Oh no!  They're going to kill me.  They're actively killing me while I type this!  I am a political prisoner!!!  HELP ME!\"Assange is a manchild.  Chelsea Manning has balls of fucking steel compared to Assange's small man/victim complex.  The reason Manning didn't get half a million dollars is because she's principled, you know, they kind of thing that's actually difficult to buy off.\nIt's a big club, and you ain't in it.\n--George Carlin\nThe BTC whale is likely someone who sees Assange as a useful idiot.  Wants to make sure he's taken care of for the next game Assange will play as a pawn in.\nAnd yeah, Julian Assange is a dolt.  He's like that idiot in class who'd make a sound and then stop when you look at them and wonder what you're looking at.  Assange is a perpetual pot stirrer and the whale is buying a Grade A Black and Decker Pot Stirrer with the half million dollars.\nI think this whole episode is some bullshit.  He totally came out the gate as \"look, I'm being a freedom fighter and exposing the truth\" and then when consequences came, he ran and hid in an embassy.  AND while he was hiding there, he kept posting \"I'm a big man\" bullshit until he eventually burned every ounce of goodwill the embassy extended to him.  AND THEN once he was finally suffering consequences and not even serious ones, \"Oh no!  They're going to kill me.  They're actively killing me while I type this!  I am a political prisoner!!!  HELP ME!\"\nAssange is a manchild.  Chelsea Manning has balls of fucking steel compared to Assange's small man/victim complex.  The reason Manning didn't get half a million dollars is because she's principled, you know, they kind of thing that's actually difficult to buy off.\n\"Oh no! They're going to kill me. They're actively killing me while I type this! I am a political prisoner!!! HELP ME!\"Yeah, it looked like paranoid drama, and then there was Jeffrey Epstein...\n\"Oh no! They're going to kill me. They're actively killing me while I type this! I am a political prisoner!!! HELP ME!\"\nYeah, it looked like paranoid drama, and then there was Jeffrey Epstein...\nhe ran and hid in an embassyLet's hear it from you, hero. If the US government came after you wielding a stick that says \"175 years in maximum security prison\" and you know they have another stick called \"Gitmo\" and \"black sites\" behind their back - you'd stand proud and let them do to you whatever, right?Any sane person would attempt to escape that.I do agree that Chelsea took the bigger risk. But among Chelsea, Snowden and Assange, the US is making it very clear what you can expect when you show the world that they aren't angels powdered in fairy dust.\nhe ran and hid in an embassy\nLet's hear it from you, hero. If the US government came after you wielding a stick that says \"175 years in maximum security prison\" and you know they have another stick called \"Gitmo\" and \"black sites\" behind their back - you'd stand proud and let them do to you whatever, right?\nAny sane person would attempt to escape that.\nI do agree that Chelsea took the bigger risk. But among Chelsea, Snowden and Assange, the US is making it very clear what you can expect when you show the world that they aren't angels powdered in fairy dust.\nIf the US government came after you wielding a stick that says \"175 years in maximum security prison\" and you know they have another stick called \"Gitmo\" and \"black sites\" behind their back - you'd stand proud and let them do to you whatever, right?What's the saying?  It's better to die the death of a hero, than to live the life of a coward.An Manning showed the correct way to obtain respect.  Assange is just looking for his next paycheck and some group of bigger idiots to masturbate his ego.\nIf the US government came after you wielding a stick that says \"175 years in maximum security prison\" and you know they have another stick called \"Gitmo\" and \"black sites\" behind their back - you'd stand proud and let them do to you whatever, right?\nWhat's the saying?  It's better to die the death of a hero, than to live the life of a coward.\nAn Manning showed the correct way to obtain respect.  Assange is just looking for his next paycheck and some group of bigger idiots to masturbate his ego.\nWhat's the saying? It's better to die the death of a hero, than to live the life of a coward.\nIt's easy to tell other people to die nobly from the anonymous safety of a keyboard.\nIt's just a saying man. The funny thing about this absurd notion is that you people think that death was something that would happen. The reality is he would have been free a lot sooner had he just faced the charges rather than ran away from the law. The 175 years is a fantasy figure that had no remote chance of sticking. The actual crimes that he would have a chance of being proven guilty of would have locked him up for only a few 10s of years but under the sentencing guidelines would have been a fraction\nLike I said easy to say when you have no skin in the game.\nThe UK has sent a lot of people to America under dubious circumstances and even given that the judges blocked it given the high likelihood of mistreatment.\nIt was a face saving exercise because real permanent damage was about to be done to the very one sided extraction agreement. Without this he would have been fucked.\nI just avoid raping anyone so this hasn't been an issue\nI just avoid raping anyone so this hasn't been an issueAh, the paid trolls are coming out.Was Julian convicted of the crime of rape? Nope. Was he even tried? Nope.So, if you want to be true to facts, you'd have to say \"I just avoid being accused of raping...\" - I wonder how you're going to do that.\nI just avoid raping anyone so this hasn't been an issue\nAh, the paid trolls are coming out.\nWas Julian convicted of the crime of rape? Nope. Was he even tried? Nope.\nSo, if you want to be true to facts, you'd have to say \"I just avoid being accused of raping...\" - I wonder how you're going to do that.\nBradley Manning didnâ(TM)t go to jail for very long and wasnâ(TM)t treated poorly. He is also a political and media hack so he came back in good graces and even became a regular in various political events, basically if you want to be a useful idiot, you donâ(TM)t have to serve timeS\nTo fly private jet? I see absolutely no reason anyone should have prohibited a commercial flight. First class ticket, maybe hire a bodyguard if people were feeling paranoid./blockquote\nBecause celebrities and divas.\nYou don't dare tell Assange he's to take a commercial flight - first class? That's not good enough.\nHe's a celebrity. He's going to travel like one. Private jets only from now on.\nCommercial flights? Nope, not going to happen. Not even Emirates or Singapore Airlines first class apartments (yes, a wh\nWhy did he have to fly private?  There aren't any commercial flights to Guam?\nThis expense is one he chose for himself.  Fuck him and his crying poverty while traversing half the globe on a private jet.\n\"The U.S. government wasn’t willing to go as far as releasing him onto a commercial flight, and Assange wasn’t willing to let U.S. Marshals escort him. So a compromise was struck: Assange would take a private plane to and from the island, escorted by an Australian ambassador.\" -- https://www.washingtonpost.com... [washingtonpost.com]\nI am posting a second time this link, it seems a common interrogation right now. Note that the information is in the news for some days,  I read about it when slashdot published the previous Assange story on the 24th.\n\"more\"? He wasn't with one to start with. If I were him, I also wouldn't trust a US marshal.\n\"more\"? He wasn't with one to start with. If I were him, I also wouldn't trust a US marshal.Nonsense. A marshal delivers people, end of story.\n\"more\"? He wasn't with one to start with. If I were him, I also wouldn't trust a US marshal.\nNonsense. A marshal delivers people, end of story.\nHe did not like the look of the handcuffs they were going to be using (According to another poster).\nNonsense. A marshal delivers people, end of story.\nTo where? Gitmo? A nice black site to be tortured?\nDude, they already made an agreement.  Do you think a federal judge is going to look on DoJ lying about tendering a legal proffer in order to get a very public guy onto US soil very publicly and then he all of a sudden disappears to a black site?\nDoJ wants this over with.  Why would they do all this just to stick it to a guy that has zero leverage over anything at all?  It's conspiracy theory horseshit that makes no sense.\nDude, they already made an agreement.\nYeah remember how they kidnapped people from Sweden and tourtured them? Yeah that was COMPLETELY illegal yet they did it. How can you guarantee they won't do it again?\nDo you think a federal judge is going to look on DoJ lying about tendering a legal proffer in order to get a very public guy onto US soil very publicly and then he all of a sudden disappears to a black site?\nWell, it's bit a bit late for Assange then. Sorrynotsorry we tortured you. On the plus side this fede\nI don't go by the the \"black site\" argument, but by the legal uncertainty. If Assange is handcuffed next to a US Marshall, he is still formally under custody. For as long as he is under custody, it is easy for a different law enforcement agency or another judge to order additional interrogations or proceedings based on an aspect of the case that was not considered until now (or challenge the validity of the agreement). I trust that Assange would win in the end because the agreement is valid and \"non bis in\nNonsense. A marshal delivers people, end of story. To where? Gitmo? A nice black site to be tortured?Not in this case, the destination is a penal colony named Australia.\nNonsense. A marshal delivers people, end of story.\nTo where? Gitmo? A nice black site to be tortured?\nNot in this case, the destination is a penal colony named Australia.\nWhy did he have to fly private?  There aren't any commercial flights to Guam?This expense is one he chose for himself.  Fuck him and his crying poverty while traversing half the globe on a private jet.Found the CIA bootlicker.\nWhy did he have to fly private?  There aren't any commercial flights to Guam?\nThis expense is one he chose for himself.  Fuck him and his crying poverty while traversing half the globe on a private jet.\nFound the CIA bootlicker.\nWTF, did he buy the private jet? Why would a flight with a private het cost $500.000, it shouldn't cost more then $50k.Who really cares. I hope he pockets a huge profit as compensation for being tortured by US and UK filth.\nWTF, did he buy the private jet? Why would a flight with a private het cost $500.000, it shouldn't cost more then $50k.\nWho really cares. I hope he pockets a huge profit as compensation for being tortured by US and UK filth.\nCouldn't he just fucking fly commercial like the rest of us?\nHave you ever been escorted on a commercial flight by a US marshall with the nontrivial risk you mgiht wind up diverted to a black site to be tortured?\nNo?\nWell then what the fuck are you bitching about?\nis shoot the private airplane down, or it gets involved in some \"accident\". Having Assange on a private airplane minimizes casualties. A 747 full of innocents isn't going to be ignored lightly, you know.\nI hope he pays taxes on that half million.\nThese flights happen in the ten of thousands daily, no one complains when rich people squander our capital on self-indulgence\nclassism, just saying\nThere may be more comments in this discussion. Without JavaScript enabled, you might want to turn on Classic Discussion System in your preferences instead.\nThe Nation's Oldest Nonprofit Newsroom Is Suing OpenAI and Microsoft\nAI-Generated Al Michaels To Deliver Paris Olympics Highlights\n\"I've finally learned what `upward compatible' means.\tIt means we\n  get to keep all our old mistakes.\"\n -- Dennie van Tassel"
}