{
    "title": "Monday was the hottest ever day on Earth",
    "url": "https://www.nationalobserver.com/2024/07/24/news/monday-was-hottest-ever-day-earth",
    "publishedAt": "2024-07-24T13:14:26Z",
    "content": "Monday was recorded as the hottest day ever globally, beating a record set the day before, as countries around the world from Japan to Bolivia to the United States continue to feel the heat, according to the European climate change service.\nProvisional satellite data published by Copernicus on Wednesday showed that Monday broke the previous day's record by 0.06 degrees Celsius (0.1 degree Fahrenheit).\nClimate scientists say the world is now as warm as it was 125,000 years ago because of human-caused climate change. While scientists cannot be certain that Monday was the very hottest day throughout that period, average temperatures have not been this high since long before humans developed agriculture.\nThe temperature rise in recent decades is in line with what climate scientists projected would happen if humans kept burning fossil fuels at an increasing rate.\n“We are in an age where weather and climate records are frequently stretched beyond our tolerance levels, resulting in insurmountable loss of lives and livelihoods,” Roxy Mathew Koll, a climate scientist at the Indian Institute of Tropical Meteorology.\nCopernicus’ preliminary data shows the global average temperature Monday was 17.15 degrees Celsius, or 62.87 degrees Fahrenheit. The previous record before this week was set just a year ago. Before last year, the previous recorded hottest day was in 2016 when average temperatures were at 16.8 degrees Celsius, or 62.24 degrees Fahrenheit.\nWhile 2024 has been extremely warm, what kicked this week into new territory was a warmer-than-usual Antarctic winter, according to Copernicus. The same thing happened on the southern continent last year when the record was set in early July.\nCopernicus records go back to 1940, but other global measurements by the United States and United Kingdom governments go back even further, to 1880. Many scientists, taking those into consideration along with tree rings and ice cores, say last year’s record highs were the hottest the planet has been in about 120,000 years. Now the first six months of 2024 have broken even those.\nWithout human-caused climate change, scientists say that extreme temperature records would not be broken nearly as frequently as is happening in recent years.\nFormer head of U.N. climate negotiations Christiana Figueres said “we all scorch and fry” if the world doesn't immediately change course.\n“One third of global electricity can be produced by solar and wind alone, but targeted national policies have to enable that transformation,” she said.\nAP science writer Seth Borenstein contributed to this report.\nThe Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content."
}