{
    "title": "Mt. Gox moves nearly $2.7 billion in bitcoin, signaling anticipated payouts",
    "url": "https://readwrite.com/mt-gox-bitcoin-payments-address-kraken-distributions/",
    "publishedAt": "2024-07-16T21:12:27Z",
    "content": "Radek Zielinski is an experienced technology and financial journalist with a passion for cybersecurity and futurology.\nOwen Good is a 15-year veteran of video games writing, also covering pop culture and entertainment subjects for the likes of Kotaku and Polygon. He…\nOver 48,641 BTC ($3.1 billion) moved from Mt. Gox to Kraken, part of a series of transfers including test and internal transactions. Kraken and other exchanges are managing Mt. Gox creditor payments, with varying payout deadlines from 20 to 90 days. Mt. Gox, once handling 70% of global Bitcoin transactions, filed for bankruptcy in 2014 after losing 850,000 BTC to hacks.\nOn Tuesday, a significant Bitcoin (BTC) movement occurred from addresses associated with Mt. Gox, the defunct cryptocurrency exchange.\nAt 8:12 a.m. UTC, over 48,641 BTC (valued at $3.1 billion) was transferred from a Mt. Gox-labeled address to an unlabeled address “3JQie.” This large transfer followed a series of earlier movements, including a presumed test transaction of 0.021 BTC, an internal transfer of 44,000 BTC, and another transfer of nearly 42,588 BTC to an address later identified as another internal address.\nKraken, one of the exchanges chosen to manage creditor payments, confirmed receiving Bitcoin and Bitcoin Cash (BCH) transfers from the Mt. Gox Rehabilitation Trustee. Blockchain analytics platform Arkham suggested the “3JQie” address is likely associated with Kraken, with the funds currently remaining unspent.\nTwo Japanese exchanges, Bitbank and SBI VC Trade, have already distributed their allocated funds. Other selected firms — BitGo, Bitstamp, and Kraken — have varying payout deadlines ranging from 20 to 90 days.\nThese movements precede an anticipated $9 billion worth of Bitcoin repayments to Mt. Gox creditors. The exchange filed for bankruptcy in February 2014 after losing approximately 850,000 BTC to multiple hacks. The Bitcoin price experienced a temporary dip from $65,000 to $63,000 during these transfers before recovering.\nMt. Gox was once the world’s largest Bitcoin exchange, handling over 70% of all Bitcoin transactions worldwide at its peak. Founded in 2010 by Jed McCaleb and later sold to Mark Karpelès, the Tokyo-based exchange played a crucial role in the early days of cryptocurrency trading.\nThe name “Mt. Gox” originally stood for “Magic: The Gathering Online eXchange,” as it was initially created to be a trading platform for the popular card game before pivoting to Bitcoin trading. In February 2014, Mt. Gox suspended trading, closed its website, and filed for bankruptcy protection.\nThis event was one of the most significant setbacks in the history of Bitcoin, shaking investor confidence and highlighting the need for better security measures in the cryptocurrency industry. The incident led to ongoing legal proceedings and attempts to compensate affected users.\nThe ReadWrite Editorial policy involves closely monitoring the tech industry for major developments, new product launches, AI breakthroughs, video game releases and other newsworthy events. Editors assign relevant stories to staff writers or freelance contributors with expertise in each particular topic area. Before publication, articles go through a rigorous round of editing for accuracy, clarity, and to ensure adherence to ReadWrite's style guidelines.\nRadek Zielinski is an experienced technology and financial journalist with a passion for cybersecurity and futurology.\nWith Bitcoin back in the green, up 13% on the week at $66,000, and Ethereum seeing gains as ETFs prepare to go live soon, the cryptocurrency market is beginning to...\n\n\nBy signing up, you agree to our Terms and Privacy Policy. Unsubscribe anytime.\nExplore the latest in tech with our Tech News. We cut through the noise for concise, relevant updates, keeping you informed about the rapidly evolving tech landscape with curated content that separates signal from noise.\nExplore tech impact in In-Depth Stories. Narrative data journalism offers comprehensive analyses, revealing stories behind data. Understand industry trends for a deeper perspective on tech's intricate relationships with society.\nEmpower decisions with Expert Reviews, merging industry expertise and insightful analysis. Delve into tech intricacies, get the best deals, and stay ahead with our trustworthy guide to navigating the ever-changing tech market.\nREGULATION & HIGH RISK INVESTMENT WARNING: Trading Forex, CFDs and Cryptocurrencies is highly speculative, carries a level of risk and may not be suitable for all investors. You may lose some or all of your invested capital, therefore you should not speculate with capital that you cannot afford to lose. The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. Please note that we do receive advertising fees for directing users to open an account with the brokers/advertisers and/or for driving traffic to the advertiser website\n© ReadWrite. All Rights Reserved."
}