{
    "title": "Mt. Gox to repay investors in Bitcoin",
    "url": "https://readwrite.com/mt-gox-to-repay-investors-in-bitcoin/",
    "publishedAt": "2024-07-08T16:29:11Z",
    "content": "Radek Zielinski is an experienced technology and financial journalist with a passion for cybersecurity and futurology.\nMt. Gox will repay investors in Bitcoin and Bitcoin Cash after its 2014 collapse. Mt. Gox, once the top Bitcoin exchange, lost 850,000 BTC due to hacking and security issues. The repayments could affect Bitcoin's market by increasing its circulating supply.\nMt. Gox, once the world’s leading Bitcoin (BTC) exchange, is set to begin repaying investors using Bitcoin and Bitcoin Cash (BCH).\nThe repayment was announced on July 5 over a decade after Mt. Gox’s catastrophic collapse. The announcement reads:\nOn July 5,2024, the Rehabilitation Trustee made repayments in Bitcoin and Bitcoin\nCash to some of the rehabilitation creditors through a part of the Designated\nCryptocurrency Exchanges etc. in accordance with the Rehabilitation Plan.\nMt. Gox, short for “Magic: The Gathering Online eXchange,” was founded in 2010 by Jed McCaleb and later sold to Mark Karpelès. Originally created to facilitate trading cards for the game Magic: The Gathering, it pivoted to become a Bitcoin exchange in 2010. At its peak in 2013, Mt. Gox handled over 70% of all Bitcoin transactions worldwide, making it the largest cryptocurrency exchange of its time.\nIn February 2014, Mt. Gox abruptly ceased operations and filed for bankruptcy. The exchange announced it had lost approximately 850,000 BTC, valued at about $450 million at the time. This loss, attributed to a combination of hacking and poor security practices, sent shockwaves through the nascent cryptocurrency community.\nMt. Gox’s collapse was a watershed moment for Bitcoin and the broader cryptocurrency ecosystem. It highlighted the risks associated with centralized exchanges and the importance of robust security measures in handling digital assets. The incident led to increased scrutiny of cryptocurrency exchanges and calls for better regulation in the industry.\nNow, nearly a decade later, Mt. Gox is preparing to repay some of its creditors. The exchange recently issued a notice outlining plans to compensate investors using Bitcoin and Bitcoin Cash. Remarkably, the value of the lost Bitcoin has appreciated significantly since 2014, now worth over $50 billion. This means some creditors might receive more in value than their initial investments, despite the exchange’s inability to recover all lost assets.\nThe repayment process introduces an intriguing dynamic to the cryptocurrency market. As Mt. Gox releases Bitcoin to creditors, it will increase the circulating supply of the cryptocurrency. Basic economic principles suggest this could potentially exert downward pressure on Bitcoin’s price.\nThe ReadWrite Editorial policy involves closely monitoring the tech industry for major developments, new product launches, AI breakthroughs, video game releases and other newsworthy events. Editors assign relevant stories to staff writers or freelance contributors with expertise in each particular topic area. Before publication, articles go through a rigorous round of editing for accuracy, clarity, and to ensure adherence to ReadWrite's style guidelines.\nRadek Zielinski is an experienced technology and financial journalist with a passion for cybersecurity and futurology.\nWith Bitcoin back in the green, up 13% on the week at $66,000, and Ethereum seeing gains as ETFs prepare to go live soon, the cryptocurrency market is beginning to...\n\n\nBy signing up, you agree to our Terms and Privacy Policy. Unsubscribe anytime.\nExplore the latest in tech with our Tech News. We cut through the noise for concise, relevant updates, keeping you informed about the rapidly evolving tech landscape with curated content that separates signal from noise.\nExplore tech impact in In-Depth Stories. Narrative data journalism offers comprehensive analyses, revealing stories behind data. Understand industry trends for a deeper perspective on tech's intricate relationships with society.\nEmpower decisions with Expert Reviews, merging industry expertise and insightful analysis. Delve into tech intricacies, get the best deals, and stay ahead with our trustworthy guide to navigating the ever-changing tech market.\nREGULATION & HIGH RISK INVESTMENT WARNING: Trading Forex, CFDs and Cryptocurrencies is highly speculative, carries a level of risk and may not be suitable for all investors. You may lose some or all of your invested capital, therefore you should not speculate with capital that you cannot afford to lose. The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. Please note that we do receive advertising fees for directing users to open an account with the brokers/advertisers and/or for driving traffic to the advertiser website\n© ReadWrite. All Rights Reserved."
}