{
    "title": "Mt Gox Begins Creditor Repayments in Bitcoin and Bitcoin Cash",
    "url": "https://readwrite.com/mt-gox-begins-creditor-repayments-in-bitcoin-and-bitcoin-cash/",
    "publishedAt": "2024-07-05T11:01:57Z",
    "content": "Radek Zielinski is an experienced technology and financial journalist with a passion for cybersecurity and futurology.\nSam Shedden is an experienced journalist and editor with over a decade of experience in online news. A seasoned technology writer and content strategist, he…\nThe Mt. Gox trustee has started repayments to creditors in Bitcoin and Bitcoin Cash through select exchanges. Creditors must verify accounts, agree to terms, and complete discussions with the trustee for prompt repayments. Following a 47,228.7 BTC transfer, Bitcoin's price dropped 7.6% to $54,363, amid $665 million in market liquidations.\nThe rehabilitation trustee of Mt. Gox, the defunct cryptocurrency exchange, announced on Friday that it has initiated repayments to some creditors in Bitcoin (BTC) and Bitcoin Cash (BCH). These repayments are being processed through select cryptocurrency exchanges as outlined in the rehabilitation plan.\nAccording to a recent announcement released by the trustee, eligible creditors can expect prompt repayments if they meet certain criteria. Those include verification of registered account validity, agreement to terms set by designated crypto exchanges, and completion of necessary discussions with the trustee. The trustee has asked eligible rehabilitation creditors to remain patient during this process.\nThis announcement follows a significant movement of funds earlier today, where Mt Gox transferred 47,228.7 BTC (approximately $2.71 billion) to a wallet. Subsequently, these assets were distributed in multiple transactions, including a transfer of 1,545 BTC ($85 million) to a hot wallet on the Bitbank exchange.\nThe cryptocurrency market reacted strongly to these developments. Bitcoin’s price dropped below $54,000 at one point, and is currently trading at $54,363, representing a 7.6% decline over the past 24 hours. The wider crypto market experienced substantial liquidations, with over $665 million wiped out across centralized exchanges in the last day, according to Coinglass data.\nMt. Gox was once the world’s largest Bitcoin exchange, handling over 70% of all Bitcoin transactions globally at its peak. Founded in 2010 by Jed McCaleb and later sold to Mark Karpelès, the Tokyo-based exchange played a crucial role in the early days of cryptocurrency trading.\nHowever, Mt. Gox became infamous in February 2014 when it suddenly suspended trading, closed its website, and filed for bankruptcy protection. The company announced that it had lost approximately 850,000 BTC belonging to customers and the company, valued at more than $450 million at the time. This event was one of the most significant setbacks in Bitcoin’s history, shaking investor confidence and highlighting the need for better security measures in the crypto industry.\nSince its collapse, Mt. Gox has been undergoing a lengthy bankruptcy process, working to compensate its creditors. The recent news about repayments marks a significant milestone in this ongoing saga, potentially bringing some closure to affected users after nearly a decade.\nThe ReadWrite Editorial policy involves closely monitoring the tech industry for major developments, new product launches, AI breakthroughs, video game releases and other newsworthy events. Editors assign relevant stories to staff writers or freelance contributors with expertise in each particular topic area. Before publication, articles go through a rigorous round of editing for accuracy, clarity, and to ensure adherence to ReadWrite's style guidelines.\nRadek Zielinski is an experienced technology and financial journalist with a passion for cybersecurity and futurology.\nWith Bitcoin back in the green, up 13% on the week at $66,000, and Ethereum seeing gains as ETFs prepare to go live soon, the cryptocurrency market is beginning to...\n\n\nBy signing up, you agree to our Terms and Privacy Policy. Unsubscribe anytime.\nExplore the latest in tech with our Tech News. We cut through the noise for concise, relevant updates, keeping you informed about the rapidly evolving tech landscape with curated content that separates signal from noise.\nExplore tech impact in In-Depth Stories. Narrative data journalism offers comprehensive analyses, revealing stories behind data. Understand industry trends for a deeper perspective on tech's intricate relationships with society.\nEmpower decisions with Expert Reviews, merging industry expertise and insightful analysis. Delve into tech intricacies, get the best deals, and stay ahead with our trustworthy guide to navigating the ever-changing tech market.\nREGULATION & HIGH RISK INVESTMENT WARNING: Trading Forex, CFDs and Cryptocurrencies is highly speculative, carries a level of risk and may not be suitable for all investors. You may lose some or all of your invested capital, therefore you should not speculate with capital that you cannot afford to lose. The content on this site should not be considered investment advice. Investing is speculative. When investing your capital is at risk. Please note that we do receive advertising fees for directing users to open an account with the brokers/advertisers and/or for driving traffic to the advertiser website\n© ReadWrite. All Rights Reserved."
}