{
    "title": "Silicon Valley Hasn’t Embraced Trump. But It’s Wavering on Biden",
    "url": "https://www.wired.com/story/silicon-valley-crypto-trump-biden-debate/",
    "publishedAt": "2024-07-11T09:30:00Z",
    "content": "To revisit this article, visit My Profile, then View saved stories.\nThe supposed Silicon Valley revolt happened even before the disastrous presidential debate. “The Blue Wall of tech is crumbling before our very eyes,” Ryan Selkis, the founder and CEO of Messari crypto, wrote on X last month. He was referencing a then-upcoming event: Just days after Donald Trump was convicted on 34 criminal counts in a hush-money case, organizers of a San Francisco reception for the former president announced that it had sold out, with attendees paying $50,000 and up.\n“The voters have experienced four years of President Trump and four years of President Biden. In tech, we call this an A/B test,” wrote David Sacks, the tech investor and close associate of Elon Musk who was hosting the reception with the venture capitalist Chamath Palihapitiya. “With respect to economic policy, foreign policy, border policy, and legal fairness, Trump performed better. He is the President who deserves a second term.”\nAssertions like Selkis’ and long-winded missives like Sacks’ have seemed, in recent weeks, to augur a political tide change—and Biden’s recent debate performance provided a perfect pretext for it to take hold. Despite murmurs about how the liberal era of tech is over, though, there’s little evidence of any seismic shift, even in the aftermath of a revolt among donors and elected officials that made it briefly seem as if Biden might well end his candidacy.\nInstead, voices from the left and right agree, Silicon Valley’s political makeup has remained largely the same as always—what has changed is that those questioning it have grown noisier.\nChief among them is Sacks, who has led this presumptive movement primarily through the megaphone of his popular All In podcast, alongside bestie venture capitalists Palihapitiya, David Friedberg, and Jason Calacanis. There is no real reason to think, though, that Sacks and his group represents a broader constituency.\n“The Democratic party has run a masterclass in alienating the founders and VCs in Silicon Valley by being anti-capitalism and anti-progress,” Calacanis wrote in an email to WIRED. “Silicon Valley likes to present as liberal, but folks here are really libertarian disruptors and free market mavens in their ethos. Trump lines up better on those dimensions in their minds—they just don't like his personal style on the margins.”\nSacks, Palihapitiya, and Friedberg did not respond to requests for comment from WIRED.\n“David [Sacks] has been a Republican for a long time,” Keith Rabois, an investor and top Republican donor, wrote in an email to WIRED. “Chamath is a recent convert, but not so sure how many new Republicans there are in SV.” (Rabois wrote that, to his knowledge, there were “less than 2 serious tech leaders” at the Trump fundraiser, which his husband attended, and that the donors were mainly old-money San Francisco Republicans.)\nLinkedIn cofounder and Democratic megadonor Reed Hoffman concurs when asked if Silicon Valley stalwarts are switching parties. “They probably voted for Trump last time. They're voting for Trump again. It's not like they've switched from not voting for Trump like they voted for Biden before,” Hoffman tells WIRED. “They voted for Trump before, too. They're just louder in voice.”\nThe June fundraiser set off alarm bells suggesting that a new political movement needed to be accounted for, but little in the records of its organizers suggests deep fealty to MAGA doctrine. Palihapitiya has supported Democrats in the past and is currently CEO of Hustle, a peer-to-peer texting platform for progressives. Sacks has spent most of the 2024 election raising money for nearly every candidate running besides Biden or Trump. The Purple Good Government PAC, which is predominantly funded by Sacks, has donated money to congressional candidates across the political spectrum, and last year Sacks made donations in support of Ron DeSantis, Robert F. Kennedy Jr., and Dean Phillips, among other candidates. Sacks has also previously said that Trump should be disqualified from holding office as a result of his behavior on January 6, years before his recent endorsement.\nOther influential Silicon Valley figures and donors with well-known right-wing affinities like Peter Thiel and Elon Musk have, so far, decidedly stayed out of the race. (Thiel announced last fall that he would not be funding any candidacies this cycle; Musk has suggested that he could endorse a candidate later on in the cycle and that he was “leaning away” from Biden.)\nA WIRED analysis of campaign contributions, meanwhile, suggests that the venture industry is, if anything, more Democratic-leaning this cycle than it has been in the past. The top 20 firms that have, along with their employees, donated the most money have given about two dollars to Democrats to every one they’ve given Republicans—higher than the average over the past 10 cycles.\nThe one segment of the tech industry that has displayed a plurality of support for Republicans, if not Trump, has been the crypto industry. Key crypto leaders have long criticized the Biden administration over its plans to regulate the industry. While the major cryptocurrency PAC, Stand With Crypto, has declined to endorse a presidential candidate, its website says Trump and Kennedy are far better for the industry than Biden.\n“Bitcoin lives at the intersection of finance and energy. [Trump] sees the value in that. He wants this new industry to grow and thrive here,” says Brian Morgentstern, head of public policy at Riot Platforms, a bitcoin infrastructure company and former Trump administration Treasury Department official. “And the other side of this has been the Biden administration’s approach to the industry, which seems to be to regulate first and ask questions later.”\nWhile the crypto industry’s roots lie in Silicon Valley, it is just a small part of the greater tech ecosystem.\n“We are conflating the Silicon Valley crew with people who are, you know, like the crypto bro crew with the people who are Fortune 500 CEOs,” Lucy Caldwell, founder of Mockingbird Lab, says. “It's all getting jumbled, and any one of them wants to tell you that they speak for this sea change in favor of MAGA, regardless of whether they do or don't.”\n“The crypto industry is all about the economics on this stuff,” Hoffman says. “We'll sort out if it's Biden, but we can buy influence with Trump. So I think there's a big move from the crypto side to being pro-Trump.”\nBiden’s recent debate performance has worked to spook a group of Silicon Valley megadonors, including Laurene Powell Jobs and Ron Conway. According to The New York Times, one Silicon Valley donor called off a future fundraiser for Biden because of the debate. But instead of considering moving their support to Trump, they’ve discussed how to intervene in Biden’s nomination.\n“I have seen some emails from people in Silicon Valley who said, ‘I'm not going to donate more until I have more confidence,’” Hoffman told WIRED. “Part of the reason why you hear such a loud, like, ‘Oh Biden should release his delegates and kind of open up the convention’ is because people are so frenetic about the dangers of Trump winning.”\nIn your inbox: Will Knight's Fast Forward explores advances in AI\nInside the biggest FBI sting operation in history\nThe WIRED AI Elections Project: Tracking more than 60 global elections\nEcuador is literally powerless in the face of drought\nRest assured: Here are the best mattresses you can buy online\nMore From WIRED\nReviews and Guides\n© 2024 Condé Nast. All rights reserved. WIRED may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices"
}