{
    "title": "TikTok Lite Leaves up to 1 Billion Users With Fewer Protections",
    "url": "https://www.wired.com/story/tiktok-lite-global-south/",
    "publishedAt": "2024-07-23T04:00:00Z",
    "content": "To revisit this article, visit My Profile, then View saved stories.\nIn May, TikTok announced that it would automatically label AI-generated content on its platform. That's not true, though, of all versions of the app. A new report from the Mozilla Foundation and AI Forensics finds that TikTok’s Lite-Save Data version, aimed at users in poorer markets, not only leaves AI-generated content unlabeled, but also lacks other, similar safeguards.\n“Labeling is a very important tactic that platforms use to deliver some form of trust and safety,” says Odanga Madung, a Mozilla fellow and coauthor of the report.\nUsers of the full version of TikTok, for example, will see labels indicating that content is graphic or depicts dangerous behavior. Some content about topics like elections and health, similarly, includes a notice encouraging users to access credible information through a “resource hub” on the app.\nOn TikTok Lite, none of these guardrails are present. Among other things, this means that with deceptive AI-generated content an issue in elections all over the world, users in poorer markets are being given less information about what’s fake and what’s real than users in richer ones.\nMadung questions why, of all the features that could be cut to optimize the app, the company included ones that make the platform safer for users. “We don’t know if this is a choice or if it’s just negligence,” he says.\n“There are several factual inaccuracies in this report which fundamentally misrepresent our approach to safety,” a TikTok spokesperson said in a statement. “The fact is content that breaks our rules is removed from TikTok Lite the same way as our main app and we offer numerous safety features.” The company declined to point to any specific inaccuracies.\nLite versions of apps have long been a way for companies to increase market share in areas where users are subject to high data costs or can only afford less advanced phones. In 2015, Meta, then Facebook, launched Facebook Lite, a stripped-down version of its app that was more compatible with 2G data networks. That same year it also launched Free Basics, which allowed users in the Global South to access the platform and certain other websites without being charged for data usage. (An app or service meeting these criteria is called “zero-rated.”) At the time, the project faced widespread criticism, particularly in India, for creating a second-tier experience for poorer customers.\nTikTok launched its Lite version in 2018 in Thailand, and rapidly expanded to other markets in Southeast Asia, including Indonesia, Malaysia, and the Philippines. The app, which unlike the full version of TikTok can run on 2G and 3G networks, now has more than 1 billion downloads, according to data from the Google Play Store. (TikTok Lite is only available for Android phones.)\n“The majority of users in the Global South are low-income and resource-constrained,” says Payal Arora, professor of inclusive AI cultures at Utrecht University. Lite versions of apps help companies get these people on board, something she says is even more critical than it has been in the past because “data is currency in this AI-driven and AI-hungry market.”\nOne example of the differences researchers found between the versions of the app has to do with Covid-19; while Lite users are referred to a resource center when actively searching for terms related to the virus, actual content about it is not labeled with a link to that center, which it is in the full version of TikTok.\nResearchers also found that captions were truncated in the Lite version of TikTok, leaving users with less context about what they’re seeing. The Lite version of the app also lacks a feature allowing users to limit the time they spend on the app and a “restricted mode” that eliminates content that “may not be appropriate for all audiences,” according to TikTok’s policies.\nBy stripping away these features, TikTok appears to be repeating the mistakes of previous Lite apps. Facebook Lite also removed elements that might have helped users better understand the content they were coming across.\n“In the case of Facebook’s Lite version, it made it harder for people to tell what was real and what wasn’t, because it often removed images as they were heavier, or made it impossible to click on links,” says Ellery Roberts Biddle, a former fellow at Harvard’s Berkman Klein Center for Internet and Society who has studied zero-rated social platforms. “These seem to be rooted in a similar lack of consideration for user empowerment.”\nMadung worries the damage caused by a lack of labels and moderation will not necessarily be limited to TikTok Lite users alone. “The content that is made on TikTok does not stay on TikTok,” he says. “People very often will download videos and share them on WhatsApp or Instagram Reels.”\nIn your inbox: The best and weirdest stories from WIRED’s archive\nHow the brain decides what to remember\nThe Big Story: Meet Priscila, queen of the rideshare mafia\nSilicon Valley's soulless plutocrats flip for Donald Trump\nEvent: Join us for The Big Interview on December 3 in San Francisco\nMore From WIRED\nReviews and Guides\n© 2024 Condé Nast. All rights reserved. WIRED may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices"
}